{
  "timestamp": 1752222429045,
  "data": "---\ntags:\n  - core\n  - form\n  - field\n  - prefix\n  - suffix\n  - text\n  - telephone\n  - url\n  - email\n  - number\n  - password\ntitle: Input\ndescription: >-\n  A text input allows the user to enter letters, numbers and symbols into the\n  user interface.\n---\n\nimport InputDemo from \"./_components/InputDemo.vue\";\n\n<InputDemo client:only=\"vue\" />\n\n## Best practice\n\n- Use natural language when writing form labels.\n- Use the length of form fields to indicate the “format” of a proper answer.\n- Use hint text to provide more context to the question being asked.\n- Before adding an icon, affix or clear button to the input, consider carefully if it is appropriate for the specific use case and if it actually helps the user.\n- Error messages should be clear, concise and should provide actionable remedies to resolve the errors.\n- The label should describe what to input and not how.\n- Use natural language and use the terms that the user would expect.\n- Don't use verbs like enter, add, input etc in the label.\n- Don't add a colon ( : ) at the end of the label.\n- Use the help text to provide additional context and explanation.\n\n<Notification>\nWe recommend that you read our <PageLink path=\"/guidelines/forms\">Form Guidelines</PageLink>. The Guidelines cover many basic recommendations to be taken into consideration when working with forms.\n</Notification>\n\n## Input types\n\nThe input component supports different input types. Specifying the input type gives you out-of-the box validation in modern browsers and prompt the most suitable keyboard on mobile devices e.g. number keyboard for the input type telefone. The component support the following input types:\n\n- text\n- telephone\n- url\n- email\n- number\n- password\n\n## Icons\n\nThe input can show an icon and a trailing icon (to the left and to the right respectively).\n\n<Example\n  imageSrc=\"./_images/icons-1.svg\"\n/>\n\n### Clickable trailing icon \n\nIf you place an icon to the right, then you also have the option to make it clickable. The most common use case is for password inputs where the user can show and hide the typed password and check whether the password is typed correctly.\n\n<Example\n  imageSrc=\"./_images/icons-2.svg\"\n/>\n\n\n## Prefix and suffix\n\nA prefix or suffix can be added to provide the user with additional help and affordance when filling out the text input.\nTypically suffixes and prefixes are used to indicate a unit that goes together with a numerical value.\n\nOnly use the prefix or suffix for symbols and standard abbreviations, and units of measurement.\n<br /> _e.g. USD, kg, m², m³, ft³/h, °C, etc_.\n\nIn addition to suffixes and prefixes use labels, tooltips, and hints to provide more context and guidance on what information is required from people.\n\n<Example\n  imageSrc=\"./_images/prefix-and-suffix.svg\"\n/>\n\n## Clear button\n\nA clear button can be added to the input and is a shortcut action allowing the user to clear the current value. It is useful for clearing search fields and on mobile devices where entering information can be a cumbersome task.\n\n<Notification>\nAvoid having an icon to the right or suffix and a clear button as this make the user experience rather complex.\n</Notification>\n\n<Example\n  imageSrc=\"./_images/clear-button.svg\"\n/>\n\n## Label\n\nBy default, the component has a top-positioned label. It is possible to change the position of the label to be left-positioned. We recommend that you use the top-positioned labels wherever possible, especially in forms. You can read more about why we recommend top-positioned labels in our <PageLink path=\"/guidelines/forms/#label-positioning\">form guidelines</PageLink>.\n\n<Notification>\nLearn how to write good and consistent labels - see our <PageLink path=\"/content/labels/#form-field-labels\">Label Guidelines</PageLink>.\n</Notification>\n\n## Placeholder\nPlaceholder text can help users understand what kind of information they need to provide, and how to format it correctly. If the expected information has a standard format, it is better to use <PageLink path=\"/guidelines/input-masks\">Input mask</PageLink> to assist the user. \n\n<Notification appearance=\"warning\" heading=\"Avoid using placeholder text to replace labels.\">\nPlaceholder text should be used with care since it disappears when the user starts typing. \n</Notification>\n\n<Example\n  imageSrc=\"./_images/placeholder.svg\"\n  caption=\"Placeholder text should guide the user what can be the input value.\"\n/>\n\n## Input mask\nUse an input mask when you require users to enter information in a standardised format. It will assist users in entering the correct information in the right format and will help prevent invalid input. \n\n<Example\n  imageSrc=\"./_images/input-mask.svg\"\n  caption=\"Input mask can help format credit card numbers in the full range of expected values from 10 to 19 digits.\"\n/>\n\n<Notification>\nLearn when to use <PageLink path=\"/guidelines/input-masks\">Input mask</PageLink> and when to avoid it.\n</Notification>\n\n## Hint text\n\nUse the hint text to provide additional information that can assist the user to fill out the field. Hint text is placed to the left below the input and stays permanently there while the user is typing.\n\n<Example\n  imageSrc=\"./_images/hint-text.svg\"\n/>\n\n<Notification>\nWe recommend reading the <PageLink path=\"/guidelines/forms\">forms</PageLink> guidelines.\n</Notification>\n\n## Error state\n\nHighlight an invalid text input with a red border and a red error message placed beneath the input field. Error messages should be clear, concise and provide actionable remedies to resolve the errors.\n\n<Example\n  imageSrc=\"./_images/error-state.svg\"\n/>\n\n## Vanity variant\n\nThe component supports the \"vanity\" style variant. \n\nPlease read more about this variant on our <PageLink path=\"/guidelines/forms#vanity-field-variant\">form guidelines page</PageLink>.\n\n"
}