{
  "timestamp": 1752222434367,
  "data": "---\ntags:\n  - core\n  - progress\n  - bar\ntitle: Step Indicator\ndescription: A step indicator displays and guides users through the steps of any linear multi-step journey.\nrenderAllChildPagesAsTabs: true\n---\n\nimport StepIndicatorDemo from \"./_components/StepIndicatorDemo.vue\";\n\n<StepIndicatorDemo client:only=\"vue\" />\n\n## Best practice\n\n- Use the step indicator to guide the user through a linear process organised into 3 to 6 steps.\n- If the process has more than six steps, consider simplifying it by combining or removing steps.\n- Use when validating user input before progressing to the next step in the process.\n- Use to complement a Back/Next navigation pattern in a linear sequence.\n- Label each step shortly and concisely to communicate the step's purpose.\n- When using Warning and Error appearances, use a hint text to assist the user. \n\n## Usage\n\nThe step indicator is a reliable guide that displays and navigates users through the steps of any linear multistep journey. By showing the complete, current, and pending steps, it helps manage the user’s expectations and provides a sense of support throughout the journey. It is a great component that can be used for checkout, long forms and shipment tracking process. \n\n<Grid2Cols>\n  <Example\n    imageSrc=\"./_images/usage-1.svg\"\n    caption=\"Use when the user works through a linear process that can be organised into three or more steps. e.g. Checkout flow.\"\n  />\n  <Example\n    imageSrc=\"./_images/usage-2.svg\"\n    caption=\"Use to help the user understand at what step their are  especially for journeys that take a long time. e.g Tracking a shipment.\"\n  />\n</Grid2Cols>\n\n## Step states\n\nThe step indicator steps can be put in 3 states to indicate either a completed step, a current step, or a future pending state. A single step indicator can have only one current step. \n\n<Example\n  imageSrc=\"./_images/step-states.svg\"\n  caption=\"Multiple completed and pending states can exist, but a single step indicator has only one current step. \"\n/>\n\n## Warning appearance\n\nCompleted and current steps can change appearance to communicate warning information to the user when there might be a potential problem that does not necessarily stop the user from completing the current process. Hint text can be used in the available slot under the warning step to provide additional helpful information.\n\n<Example\n  imageSrc=\"./_images/warning-appearance.svg\"\n/>\n\n## Error appearance\n\nComplete and current steps also support an error appearance that can communicate to the user when a problem prevents them from continuing the process. Error messages should be clear and concise and provide actionable remedies to resolve the errors. Hint text can be used in the available slot under the error step to provide additional helpful information.\n\n<Example\n  imageSrc=\"./_images/error-appearance.svg\"\n/>\n\n\n<Notification heading=\"Maersk Design System recommendation\">\n  Depending on the context, use the warning or error appearance in combination with <PageLink path=\"/components/notification/\">Notification</PageLink> or <PageLink path=\"/components/toast/\">Toast</PageLink> components to give additional weight to the warning or error message. \n</Notification>\n\n## Placement\n\nThe step indicator's purpose is to provide a visual representation of the user journey/process, and therefore, it is important for this component to be placed in a prominent position so users can refer to it and know how far they are in the linear process. Usual placement locations would be at the top of a page or in aside area, in some cases footer area. Typically the component is persistent and is not impacted by scrolling the content area e.g. a long form.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/placement-1.svg\"\n    caption=\"Place in an area that is persistently visible across the entire user journey.\" \n  />\n  <Example \n    imageSrc=\"./_images/placement-2.svg\" \n    caption=\"Use the appropriate orientation depending on the placement context.\" \n  />\n</Grid2Cols>\n\n## Responsiveness\n\nThe horizontal step indicator is aware of the available screen space, and by default, it will switch from horizontal to vertical orientation when the viewport or container width cannot accommodate all steps.\n Be mindful of this behaviour and account for potential layout changes. \n\n## Customisation\n\nThe step indicator steps can be customised to a certain level to support custom icons and labels with hint text. \nIt is also possible to change the colour of the step markers. However, this is not recommended unless really necessary since it can impact the accessibility of the component.  \n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/customisation-1.svg\"\n    caption=\"When using custom icons aim to use at least large fit or extra large fit, to ensure that icons with thinner stroke are visible.\"\n  />\n  <Example \n    imageSrc=\"./_images/customisation-2.svg\" \n    caption=\"Use hint text to communicate additional details that can be helpful to the user.\"\n  />\n</Grid2Cols>\n"
}