{
  "timestamp": 1752222431975,
  "data": "---\ntags:\n  - core\n  - data\ntitle: Pagination\ndescription: >-\n  Pagination is used to split large amounts of content (such as search results\n  or table rows) into manageable chunks across multiple pages.\n---\n\nimport PaginationDemo from \"./_components/PaginationDemo.vue\";\n\n<PaginationDemo client:only=\"vue\" />\n\n## Best practice\n\n- Only split up items across pages when there are more than 25\n- Show no more than 5 pages on narrow screens (mobile) and 10 pages on wide screens (desktop)\n- Place the pagination control directly below the page content it controls\n\n## Truncation\n\nThe pagination uses truncation by default to allow the user to navigate to either the first or the last page and to see the total number of pages regardless of which page is currently active. In certain cases when truncation may not be desirable - this could be the case for search results where the total number of pages is often irrelevant - it can be disabled.\n\n<Example\n  imageSrc=\"./_images/truncation.svg\"\n/>\n\n## Simplification\n\nIn cases where the user needs for pagination are very light or if the screen real estate is limited it is possible to hide the button labels (by enabling the ‘hiddenlabels' control) and/or the page numbers (by setting the 'visiblepages’ control to 0).\n\n<Example\n  imageSrc=\"./_images/simplification-1.svg\"\n/>\n\n<Example\n  imageSrc=\"./_images/simplification-2.svg\"\n/>\n\n## Pagination alternatives\n\nThis component is general-purpose pagination. However, in some cases more simple or advanced controls may be appropriate.\n\n### Infinite scroll\n\nAllows the user to seamlessly scroll down a long list of items without overloading the server. This approach is generally discouraged due to the lack of user control and an inability to reach the bottom of the page.\n\n### 'Load more' button\n\nAllows the user to load more results on demand without having to reload the entire page or dealing with a pagination control (which has been shown to discourage users from exploring past the first page). This approach is encouraged when the user is browsing through items (explorative) rather than looking for a specific/known item (goal-oriented)\n\n### Advanced pagination\n\nWe intend to introduce a separate component/guidelines for advanced pagination. If the users of your product have advanced pagination needs, please <PageLink path=\"/about/the-team\">reach out to us</PageLink>. We would love to learn more about the specific use case and make sure the new component will meet all user needs.\n\nCould additionally allow the user to:\n\n- See the total number of items\n- See the number of items displayed on each page\n- See the interval of items displayed on the active page\n- Change the number of items displayed on each page\n- Manually enter and navigate to any specific page\n\nThis approach is encouraged when the user has advanced needs for accessing and manipulating data, as would be the case with advanced data tables.\n\n### Filter, sort and search\n\nIf the user knows what they are looking for it may be worth saving them the hassle of browsing through multiple pages by allowing them to filter, sort and search among the items.\n\n"
}