{
  "timestamp": 1752222427418,
  "data": "---\ntags:\n  - core\n  - form\n  - field\n  - files\n  - attachments\n  - download\ntitle: File Upload\ndescription: >-\n  The File Upload allows users to upload files to a specific location in the application e.g. to a form or adding data to a table. \ncontributors:\n  - mariam-alexander\n---\n\nimport FileUploadDemo from \"./_components/FileUploadDemo.vue\";\n\n<FileUploadDemo client:only=\"vue\" />\n\n## Best practice \n\n- Use the file upload when the user needs to upload one or more files.\n- The drag-and-drop variant also allows the user to choose file(s) like the default.\n- Use the Legend to commuicate the purpose of the file upload. \n- Use the Hint to communicate more details e.g. file size and format requirements.\n- Avoid placing the file upload inside a modal since files are stacked vertically.\n- Use each file's hint text to communicate additional information about the file.\n\n\n## Default vs. Drag-and-drop\n\nIn most cases, the drag-and-drop variant is the File Upload you need, since it allows for both drag-and-drop and selection of files. \n\nIf you want to keep it simple you can also choose to use the default variant, which only allows the user to select one or more files – not drag-and-drop. \n\n\n## Specify file requirements\n\nUse the hint text to communicate the file requirements, so it is clear which maximum file size and formats the file upload accepts. This way we avoid users wasting time trying to upload files that will not be accepted. \n\n<Example \n  imageSrc=\"./_images/specify-file-requirements.svg\" \n/>\n\n## Loading states\n\nEach selected file has a loading spinner icon while it is being uploaded. When the file is successfully uploaded the icon will change to a close icon.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/loading-states-1.svg\" \n    caption=\"The file is uploading.\"\n  />\n  <Example \n    imageSrc=\"./_images/loading-states-2.svg\" \n    caption=\"The file is uploaded.\"\n  />\n</Grid2Cols>\n\n\n## Validation\n\nWhen a file cannot be uploaded successfully the system will return an error and the file will changed to the invalid state and an error message will be shown. The error message should communicate what went wrong and how to resolve the issue.\n\n<Example \n  imageSrc=\"./_images/validation.svg\"\n/>\n\n## File hint text\n\nEach file has a hint text that can be used to provide additional information about the file e.g. uploading progress or file metadata. \n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/file-hint-text-1.svg\" \n    caption=\"Using the hint text to communicate upload progress.\"\n  />\n  <Example \n    imageSrc=\"./_images/file-hint-text-2.svg\" \n    caption=\"Using the hint text to communicate file size.\"\n  />\n</Grid2Cols>\n"
}