{
  "timestamp": 1752222437540,
  "data": "---\ntitle: Tree Navigation\ndescription: Organise and navigate hierarchical content with expandable and collapsible navigation items.\n---\n\nimport TreeNavigationDemo from \"./_components/TreeNavigationDemo.vue\";\n\n<TreeNavigationDemo client:only=\"vue\" />\n\n## Best practices\n\n- Always use clear and concise labels for navigation items to reduce ambiguity.\n- Group related navigation items into meaningful sections, when it makes sense.\n- Place frequently accessed or critical navigation items towards the top of the tree structure.\n- Clearly differentiate external links by including the appropriate icon.\n- Icons should only be used to assist quick recognition of navigation items and only on top level navigation items. \n\n## Usage\n\nThe Tree Navigation component provides users with a hierarchical navigation experience, allowing efficient exploration and movement through nested levels of content or application areas. It is typically placed in the side bar, optimising space and enhancing usability within logistics interfaces.\n\n<Example\n  imageSrc=\"./_images/usage.svg\"\n  caption=\"Keep the hierarchical structure simple up to 3 levels to increase the readability and accessibility. \"\n/>\n\n<Notification>\nIf you are designing internal applications please consider using the Internal application page layout. \n</Notification>\n\n### Labels\n\nUse clear, context-specific labels that directly reflect users’ tasks and expectations within the navigation context. Avoid generic terms such as \"Home,\" as these can lead to ambiguity—users may interpret them differently based on their individual expectations or previous experiences.\n\n<Grid2Cols>\n  <Example\n    imageSrc=\"./_images/labels-do.svg\"\n    caption=\"Use descriptive labels that manage user expectations.\"\n    indicator=\"success\"\n  />\n  <Example\n    imageSrc=\"./_images/labels-dont.svg\"\n    caption=\"Don’t use ambiguous or overly generic navigation labels.\"\n    indicator=\"error\"\n  />\n</Grid2Cols>\n\n### Icons\n\nUse icons primarily for top-level navigation items to maintain clarity and reduce visual clutter in the navigation structure. Be cautious with icon selection, as icons can introduce ambiguity—different users may associate the same icon with varying meanings based on personal experiences. For instance, a truck icon could represent logistics, land transport, delivery services, or general transportation, depending on the user's context.\n\n<Grid2Cols>\n  <Example\n    imageSrc=\"./_images/icons-do.svg\"\n    caption=\"Use icons only for top level navigation items.\"\n    indicator=\"success\"\n  />\n  <Example\n    imageSrc=\"./_images/icons-dont.svg\"\n    caption=\"Don’t use icons on all navigation levels.\"\n    indicator=\"error\"\n  />\n</Grid2Cols>\n\n### Section separators\n\nUse section separators strategically to visually group related navigation items, enhancing clarity and readability within the navigation structure. Avoid excessive use of separators, as too many can fragment the navigation and create visual noise.\n\n<Grid2Cols>\n  <Example\n    imageSrc=\"./_images/section-separators-do.svg\"\n    caption=\"Use section separators sparingly when it makes sense.\"\n    indicator=\"success\"\n  />\n  <Example\n    imageSrc=\"./_images/section-separators-dont.svg\"\n    caption=\"Don’t over segment navigation sections.\"\n    indicator=\"error\"\n  />\n</Grid2Cols>\n"
}