{
  "timestamp": 1752222424967,
  "data": "---\ntags:\n  - segmented\n  - action\n  - select\n  - multi-select\n  - toggle\n  - form\n  - toolbar\n  - split\ntitle: Button Group\ndescription: >-\n  Combines individual buttons that have a logical relationship into a cohesive group of actions. \nrelatedPages:\n  - /components/button/\n  - /components/segmented-control/\n  - /components/tabs/\n  - /guidelines/selection-components/\nrenderAllChildPagesAsTabs: true\n---\n\nimport ButtonGroupDemo from \"./_components/ButtonGroupDemo.vue\";\n\n<ButtonGroupDemo client:only=\"vue\" />\n\n## Best practice\n\n#### Do:\n- Use the Button Group to group related actions e.g. Edit, Archive, Delete.\n- Limit Button Groups to 4-5 items and keep labels short. Limiting ensures all buttons are clearly visible across different screen sizes. \n- Keep the content type of each button consistent e.g. icons only, labels only etc.\n\n#### Do not:\n- Use the component to group buttons simply because they are placed close to each other. Button Groups should only contain buttons of related actions. \n- Use Button Groups to navigate between content within a page. For this purpose, use the <PageLink path=\"/components/tabs/\">Tabs component</PageLink>\n\n#### Other:\n- Button Groups configured to be either single or mult-select may ve used as form control e.g. as an alternative for a Radio Group or a Checkbox Group. Please check the <PageLink path=\"/guidelines/selection-components/\">Selection components</PageLink> guideline for more information.\n\n\n## Usage\nThe Button Group is a great component to use in dense interface applications where users might need to interact with many actions and the journeys are complex. By bundling multiple related actions and controls together users can understand quicker the available options. The compact nature of the Button Group helps keep the UI more organised.\n\nSee below a few examples of when you should consider using a Button Group.\n\n\n### Horizontal button group\nCombine several actions such as Edit, Archive, and Delete, that are related to one or multiple objects in the user interface to provide a distinguishable grouping of actions that will impact for example the selected table rows. \n\n<Example\n  imageSrc=\"./_images/horizontal-button-group.svg\"\n/>\n\n### Vertical icon-only button group\nIn some contexts, you can use the vertical orientation and customisable styles in the button group to show actions or filters as an overlay. \n\n<Example \n  imageSrc=\"_images/map.png\" \n  caption=\"Example demonstrating a vertical button group to control the zoom of a map.\"\n  darkWarning={false} \n/>\n\n\n### Indicating selection\nButton group can be used as a single and multi-select control. This can be in the context of a form to collecting data from users or as controls for enabling filters on and off. \n\n<Example\n  imageSrc=\"./_images/indicating-selection-1.svg\"\n  caption=\"Multi-select button group that can be toggled to activate different options.\"\n/>\n\n<Example\n  imageSrc=\"./_images/indicating-selection-2.svg\"\n  caption=\"Using a single select button group to collect user feedback from your application.\"\n/>\n\n\n\n"
}