{
  "timestamp": 1752222437232,
  "data": "---\ntags:\n  - core\ntitle: Tooltip\ndescription: >-\n  A tooltip is a descriptive text box that is used to provide contextual\n  information about a UI element.\n---\n\nimport TooltipDemo from \"./_components/TooltipDemo.vue\";\n\n<TooltipDemo client:only=\"vue\" />\n\n<br /><br />\n\nA tooltip is displayed when the user hovers or focuses on the element that the tooltip describes.\n\n## Best practice\n\n- The tooltip should always be placed in close proximity to the element it describes.\n- Only use a tooltip when additional information is needed to understand the UI.\n- Use tooltips to describe the difference between very similar elements.\n\n## Usage\nA tooltip component is a user interface element that displays a short message when the user hovers over, focuses on, or taps an element (e.g. icon or text). The message usually provides additional information or guidance about the element, such as its function or purpose. A tooltip component can be used to enhance the usability and accessibility of a web page or application. \n\n### Positions\n\n<Example\n  imageSrc=\"./_images/positions.svg\"\n  caption=\"9 tooltip positions.\"\n/>\n\n### Use within text\nUse tooltip when the element has a label that is not clear or descriptive enough, and you want to explain what it does or what it means. For example, use a tooltip component to show the full name of an acronym, the definition of a term, or the description of a feature.\n\n<Example\n  imageSrc=\"./_images/use-within-text.svg\"\n  caption=\"Example within text paragraph\"\n/>\n\n<Example\n  imageSrc=\"../table/_images/header-tooltips.svg\"\n  caption=\"A table with header tooltips.\"\n/>\n\n\n### Use with non-text elements\nTooltip can also be used when the element has no label at all, and you want to provide a hint or instruction to the user. For example, use a tooltip component to show what action will be performed when the user clicks on an icon, what information is required in a form field, or what keyboard shortcut is available for an operation.\n\n<Example\n  imageSrc=\"./_images/use-with-non-text-elements.svg\"\n  caption=\"Example within text paragraph\"\n/>\n\n<Notification>\nTooltip content should only be supplementary and not information that is needed for the completion of the user journey. \n</Notification>\n\n"
}