{
  "timestamp": 1752222430272,
  "data": "---\ntags:\n  - core\n  - spinner\n  - bar\n  - status\n  - ring\ntitle: Loading Indicator\ndescription: >-\n  A loading indicator informs users that the system is processing a task where the duration is unknown. \n---\n\nimport LoadingIndicatorDemo from \"./_components/LoadingIndicatorDemo.vue\";\n\n<LoadingIndicatorDemo client:only=\"vue\" />\n\n## Best practice\n\n- Clearly communicate the purpose of loading using concise labels and aria-labels. (e.g Loading table data)\n- Use loading indicators when the duration of loading is unknown or can’t be predicted.\n- Consider using the <PageLink path=\"/components/toast/\">toast component</PageLink> to let users know when loading is completed or has failed. \n\n## Usage\n\nLoading indicators can be embedded in various UI elements or even full pages to indicate information is being loaded. However, there are instances where you should avoid using them or opt for the <PageLink path=\"/components/progress-indicator/\">progress indicator</PageLink> that can better manage the user’s expectation by showing measurable progress.\n\n<div class=\"mds-table mds-table--small mds-table--vertical-lines-solid\">\n  <table>\n    <thead>\n      <tr>\n        <th>Scenario</th>\n        <th>Loading indicator</th>\n        <th>Progress indicator</th>\n      </tr>\n    </thead>\n    <tbody>\n      <tr>\n        <td>Unknown task duration</td>\n        <td><div class=\"flex items-center gap-2\"><Icon icon=\"check-circle-solid\" appearance=\"success\"></Icon><span>Ideal choice</span></div></td>\n        <td><div class=\"flex items-center gap-2\"><Icon icon=\"times-circle-solid\" appearance=\"error\"></Icon><span>Not suitable</span></div></td>\n      </tr>\n      <tr>\n        <td>Known, measurable progress</td>\n        <td><div class=\"flex items-center gap-2\"><Icon icon=\"times-circle-solid\" appearance=\"error\"></Icon><span>Not suitable</span></div></td>\n        <td><div class=\"flex items-center gap-2\"><Icon icon=\"check-circle-solid\" appearance=\"success\"></Icon><span>Ideal choice</span></div></td>\n      </tr>\n      <tr>\n        <td>Brief interactions (&lt;1 second)</td>\n        <td><div class=\"flex items-center gap-2\"><Icon icon=\"times-circle-solid\" appearance=\"error\"></Icon><span>Unnecessary visual noise</span></div></td>\n        <td><div class=\"flex items-center gap-2\"><Icon icon=\"times-circle-solid\" appearance=\"error\"></Icon><span>Unnecessary visual noise</span></div></td>\n      </tr>\n    </tbody>\n  </table>\n</div>\n\n### When to use\n\n- When processing duration is unpredictable, such as retrieving shipment data from multiple systems.\n- For processes initiated by user actions, such as submitting forms or generating complex reports.\n- For progressive disclosure components like drawers that load dynamic shipment information.\n- Use bar loading indicator for containers (e.g., top of screens and drawers).\n- Use ring loading indicator variant for compact spaces (e.g., buttons, list items, or table cells)\n\n### When not to use\n\n- When processing duration and progress are known and measurable, use the <PageLink path=\"/components/progress-indicator/\">progress indicator</PageLink> instead.\n- For very short waiting periods (&lt;1 sec. ), avoid loading indicators to prevent unnecessary visual distraction.\n\n## Variants\n\nThere are two variants of the loading indicator that can be applied depending on the interface requirements and user needs. These indicators visually communicate that a process is ongoing, but the exact duration or progress cannot be accurately determined.\n\n### Bar loading indicator\n\nThe bar loading indicator works effectively in wider or horizontal areas such as dashboards, form headers, or at the top of pages. It visually indicates indeterminate loading processes, reinforcing to users that the application is actively working, for example, loading new data in widgets or performing bulk updates on shipment statuses.\n\n<Example \n  imageSrc=\"./_images/bar.svg\"\n  caption=\"Bar loading indicator example.\"\n/>\n\n### Ring loading indicator\n\nThe ring loading indicator is ideal for displaying indeterminate processes in areas such as drawers, tables, buttons, or long lists. It communicates clearly to users that an action is in progress, such as fetching shipment details or dynamically populating logistics data.\n\n<Example \n  imageSrc=\"./_images/ring.svg\"\n  caption=\"Ring loading indicator example.\"\n/>\n\n## Accessibility\n\n- Use adequate colour contrasts between progress indicators and their backgrounds.\n- Make sure aria labels are present and represent correctly the label.\n- Consider visually hidden status updates via live regions for screen reader users, especially for critical real-time task updates."
}