{
  "timestamp": 1752222426481,
  "data": "---\ntags:\n  - core\n  - form\n  - time\n  - year\n  - month\n  - day\n  - calendar\n  - picker\n  - field\ntitle: Date Range\ndescription: >-\n  Lets users pick a range of dates.\nrelatedPages:\n  - /components/calendar\n  - /components/input-date\n---\n\nimport DateRangeDemo from \"./_components/DateRangeDemo.vue\";\n\n<DateRangeDemo client:only=\"vue\" />\n\n## Best practice\n\n- Make it clear what kind of date format you are asking for e.g. _YYYY-MM-DD_ or _DD-MM-YYYY_\n- Use min and max dates to help prevent user error. The selectable date should be realistic for the context and application capabilities\n- Display only week numbers in the <PageLink path=\"/components/calendar\">calendar</PageLink> popover when the context requires it and when users expect to see them by default.\n- For labels use natural language and use the terms that the user would expect.\n- The label should describe what to input and not how.\n- Don't use verbs like enter, add, input etc in the label.\n- Don't add a colon ( : ) at the end of the label.\n- Use the hint text if additional context and explanation are needed.\n- Error messages should be clear, concise and provide actionable remedies to resolve the errors.\n\n<Notification>\nWe recommend that you read our <PageLink path=\"/guidelines/forms\">Form Guidelines</PageLink>. The Guidelines cover many basic recommendations to be taken into consideration when working with forms.\n</Notification>\n\n## Orientation\n\nBy default, the component is responsive and adapts to the immediate container it is placed within, but it is also possible to force either horisontal or vertical orientation.\n\n<Grid2Cols>\n  <Example\n    imageSrc=\"./_images/orientation-1.svg\"\n  />\n  <Example\n    imageSrc=\"./_images/orientation-2.svg\"\n  />\n</Grid2Cols>\n\n## Date format & placeholder text\n\nThe placeholder texts should communicate which date format the component accepts. Do not use placeholder texts to replace labels.\n\nThe date format can be changed to meet local requirements and user expectations. As default, the component uses the ISO standard: YYYY-MM-DD (Year-Month-Day).\n\n<Example\n  imageSrc=\"./_images/orientation-1.svg\"\n/>\n\n"
}