{
  "timestamp": 1752222425561,
  "data": "---\ntags:\n  - core\n  - primary\n  - secondary\n  - plain\n  - action\n  - submit\n  - call to action\ntitle: Button\ndescription: >-\n  Buttons allow the user to execute actions and are one of the basic building\n  blocks of any user interface.\n---\n\nimport ButtonDemo from \"./_components/ButtonDemo.vue\";\nimport \"./_index.css\";\n\n<ButtonDemo client:only=\"vue\" />\n\n## Best practice\n\n- Ensure a clear visual distinction between important and less important actions.\n- Filled buttons are used for the most important actions e.g. submitting a form.\n- The Secondary Filled Button should be used in cases where you want to emphasise the Maersk brand. \n- Outlined and Plain buttons are used for less important actions, e.g. \"Back\" and \"Cancel\".\n- Don't use button labels that are ambiguous or open to interpretation - be descriptive.\n- Make sure to provide a label for icon-only buttons so the information is accessible to screen readers.\n- Never hide or disable buttons that are essential for getting the job done.\n- Button labels should use sentence case.\n- Use action verbs e.g. save, download, edit etc.\n- Combine the action verb with a noun e.g. add to basket.\n- Avoid vague language e.g. yes, no and okay.\n\n\n<Notification appearance=\"info\" heading=\"Please note\">\nUsers rely on good and consistent labels when interacting with digital products. See our <PageLink path=\"/content/labels/\">label guidelines</PageLink> for more information on how to write good labels.\n</Notification>\n\n\n## Hierarchy\n\nThe button component comes in 3 different variants - filled, outlined and plain. The different variants make it possible to create the needed hierarchy and visual distinction between the important call-to-actions in a UI and the less important ones. Below is described the hierarchy of the buttons.\n\n<Example \n  imageSrc=\"./_images/button-hierarchy.svg\"\n  caption=\"The pyramid describes the hierachy of the button variants.\"\n/>\n\n### Filled buttons\n\nThe filled buttons should be used sparingly and only for the main actions in the UI. If the UI has many actions with the same high importance, then consider using the outlined buttons.\n\n<Example \n  imageSrc=\"./_images/filled-buttons.svg\"\n  caption=\"The filled button in different appearances.\"\n/>\n\n\n#### Secondary filled button\nThe secondary filled button should be used very sparingly. It is a way to communicate the Maersk brand more directly in the UI and draw extra attention to the most important action on a page e.g. in a hero/stage element on a marketing landing page. \n\n<Example \n  imageSrc=\"./_images/secondary-filled-button.svg\"\n  caption=\"The secondary filled button should be used sparingly and in places where you want to emphasise the Maersk Brand.\"\n/>\n\nThe primary filled button should still be used for most actions in the UI and often together with the neutral outlined button. See the recommended button combinations under the section Combinations. \n\n<Notification appearance=\"warning\" heading=\"Please note\">\nThis doesn't apply to APM Terminals, since the APM Terminals brand colour (orange) is used for the Primary Filled Button. \n</Notification>\n\n\n### Outlined buttons\n\nOutlined buttons are used for medium important actions and are often used together with a filled button e.g. Confirm (filled) and Cancel (outlined). Outlined buttons are also useful in UIs that have many actions with medium or same high importance.\n\n<Example \n  imageSrc=\"./_images/outlined-buttons.svg\"\n  caption=\"The outlined button in different appearances.\"\n/>\n\n### Plain buttons\n\nPlain buttons have a visually low emphasis and are used for less important actions. Plain buttons can be used together with filled and outlined to create a tertiary action. See the recommended button combinations below.\n\n<Example \n  imageSrc=\"./_images/plain-buttons.svg\"\n  caption=\"The plain button in different appearances.\"\n/>\n\n\n## Combinations\n\nCombine the button variants in a way that creates a clear hierarchy where the user easily can understand what the most important action is. The following button combinations are recommended.\n\n<Example \n  imageSrc=\"./_images/combinations.svg\"\n/>\n\n## Form placement\n\nAlign the primary action to the left with the rest of the form. Tabbing through the form will lead the user to the primary action first, which creates a linear and clear path to completion.\n\nPlace secondary action to the right of the primary action.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/forms-do.svg\"\n    indicator=\"success\"\n    \n  />\n  <Example \n    imageSrc=\"./_images/forms-dont.svg\"\n    indicator=\"error\"\n    \n  />\n</Grid2Cols>\n\n<Notification>\nWe recommend that you <PageLink path=\"/guidelines/forms/\">read our form design guidelines</PageLink>. The Guidelines cover many basic recommendations to be taken into consideration when working with forms.\n</Notification>\n\n\n## Labels\n\nAll button labels should use English capitalization where we capitalize the first word and also capitalize proper nouns. We do not use ALL CAPS.\n\n<Grid2Cols>\n   <Example \n    imageSrc=\"./_images/labels-do.svg\"\n    indicator=\"success\"\n  />\n  <Example \n    imageSrc=\"./_images/labels-dont.svg\"\n    indicator=\"error\"\n  />\n</Grid2Cols>\n\n## Icons\n\nA button can contain an icon. By default, the icon is displayed before the label but can be configured to be a trailing icon i.e. placed after the label. It is also possible to have an icon-only button.\n\n<Example \n  imageSrc=\"./_images/icons.svg\"\n  caption=\"Default icon, trailing icon, icon only buttons \"\n/>\n\n### Icon only accessibility\n\nFor icon only buttons a ARIA-label is automatically added to ensure that users using screen readers can understand what the buttons do. It is therefore very important that we always add a clear and descriptive label to all our buttons.\n\n## Loading state\n\nEach button has a loading state that should be used for a short indeterminate wait time between 2-5 seconds. The loading state reassures the user that the action is being processed. The loading state also prevents the user from activating or sending something more than one time and thereby reduces mistakes.\n\nDon't apply the loading state to all your buttons, but only the ones where a wait time between 2-5 seconds is expected.\n\n<Example \n  imageSrc=\"./_images/loading-state.svg\"\n  caption=\"Loading state for indeterminate wait time between 2-5 seconds.\"\n/>\n\n\n## Buttons as links\n\nIt is possible to display a link as a button with the <PageLink path=\"/components/link-button/\">Link Button</PageLink> component. This style of link works well for certain call-to-actions.\n\n<Example \n  imageSrc=\"./_images/buttons-as-links.svg\"\n  caption=\"An example of a button which links to a support page.\"\n/>\n\n"
}