{
  "timestamp": 1752222429239,
  "data": "---\ntitle: Link Button\ndescription: >-\n  A link button combines the visual appearance of a button with the navigational functionality of a hyperlink.\ntags:\n  - core\n  - url\n  - primary\n  - secondary\n  - router\n  - navigation\n---\n\nimport LinkButtonDemo from \"./_components/LinkButtonDemo.vue\";\nimport \"./_index.css\";\n\n<LinkButtonDemo client:only=\"vue\" />\n\n<Notification appearance=\"warning\" heading=\"Secondary colour (appearance)\">\nThe button supports a secondary colour (appearance). However, this is has accessibility issues with the Maersk Light theme and as such we do not encourage you to use the secondary colour (which is why it is not displayed on this page).\n\n**Future versions of the button may remove the secondary colour entirely.**\n</Notification>\n\n## Best practice\n\n- Use link buttons for navigation within an app or website and other URL-change actions. \n- Link buttons can be used for important <PageLink path=\"/components/link/#stand-alone\">stand-alone links</PageLink> in the UI, e.g. a “Register” link. \n- Use clear and descriptive labels so the user understands the destination of the link.\n- The purpose of the link button should be understandable from the label alone.\n- Avoid ambiguous and vague labels that are open to interpretation. \n- Labels should be sentence case.\n- Always make sure that the link button is the best-suited option.\n\n<Notification>\nWe recommend that you read our <PageLink path=\"/content/labels\">label guidelines</PageLink> for more information on how to write good Labels. \n</Notification>\n \n## Usage\nWhile <PageLink path=\"/components/button\">regular buttons</PageLink> typically are used for on-page actions, link buttons are used for navigating within an app or website. \n\n### Primary\nThe link button can be used to highlight the most important links that lead the user forward through the main user journeys of the website or application. \n\n<Example \n  caption=\"maersk.com uses a link button to highlight the main link “Discover new paths”.\"\n  imageSrc=\"./_images/link-button-primary.png\"\n/>\n\n### Secondary\nThe link button can also be used for less critical, but still important links that sometimes have a CTA-quality to them. These buttons should be less visually prominent and it is recommended to use the outlined button style for these. \n\n<Example \n  caption=\"On this website, we use link buttons to navigate back and forward between pages.\" \n  imageSrc=\"./_images/link-button-secondary.png\"\n/>\n\n### In-page URL changes\nThe link button can also be used for in-page navigation, where the link button links to a specific section within the page. Examples of this could be a table of contents or showing/hiding specific sections of the page.\n\n<Example \n  caption=\"Expanding a section of news cards by clicking the “View all” link button.\"\n  imageSrc=\"./_images/link-button-in-page-url-changes.png\"\n/>\n\n## Icons\nLike the <PageLink path=\"/components/button\">regular buttons</PageLink>, the link button can contain an icon, either one to the left or one to the right side of the button label. It is also possible to have an icon-only button.\n\n<Example \n  imageSrc=\"./_images/icons.svg\"\n  caption=\"Default icon, trailing icon, icon only buttons \"\n/>\n\n### Icon-only accessibility\nFor icon-only buttons, an ARIA-label is automatically added to ensure that users using screen readers can understand what the buttons do. It is therefore very important that we always add a clear and descriptive label to all our buttons.\n"
}