{
  "timestamp": 1752222431493,
  "data": "---\ntags:\n  - core\n  - message\n  - communication\n  - feedback\n  - warning\n  - error\n  - info\n  - success\n  - banner\n  - alert\ncontributors:\n  - roshnimridha04\ntitle: Notification\ndescription: >-\n  Provides high-level information about different occurrences within an application.\nrelatedPages: \n  - /components/toast\n  - /components/modal\n  - /guidelines/system-feedback\n---\n\nimport NotificationDemo from \"./_components/NotificationDemo.vue\";\n\n<NotificationDemo client:only=\"vue\" />\n\n## Best practice\n\n- Use sparingly to communicate important system-triggered feedback.\n- Content should reflect the severity of the case and provide appropriate actions to the user.\n- Communicate one message at a time in clear and concise language.\n- Use easy-to-understand language (avoid technical terms).\n- When action is required, use clear call-to-action terms. e.g. “Contact support”\n- For high-urgency feedback, use a prominent placement. e.g. Full screen width notification below global navigation.\n- For low-urgency feedback, use inline placement that brings the feedback closer to the context that it addresses.\n\n<Notification>\nIf you need to display low-disruptive feedback that is mainly task-triggered, then use the <PageLink path=\"/components/toast\">Toast component</PageLink>. For high-disruptive feedback where the user needs to take action before continuing, use the <PageLink path=\"/components/modal\">Modal component</PageLink> as a dialog.\n\nSee our <PageLink path=\"/guidelines/system-feedback\">System Feedback Guidelines</PageLink> for more information on system feedback in general.\n</Notification>\n\n## Usage\n\nUse the notification component for medium to high-urgency in order to communicate mostly system-triggered feedback messages. Use to notify the user about important system information with a succinct message and when possible provide action to resolve any potential issues.\n\n## Placement\n\nThere are two main placements of notifications component - global notifcations and inline notifications.\n\n<br />\n<Grid2Cols>\n  <div>\n    <h3 style=\"margin-top: 0;\">Global notification</h3>\n    <p>Notifications can be used on global level where the notification is placed at the top of the page/app. This placement is typically for messages and feedback that related to the whole page/application and have a mid to high-urgency. </p>\n    <h4>Cases where a global Notification is a good choice:</h4>\n    <ul>\n      <li>Communicate internet connection was lost.</li>\n      <li>Upcoming maintenance.</li>\n      <li>Bigger updates or changes to the application, site, or page.</li>\n    </ul>\n  </div>\n  <div>\n    <br />\n    <Example \n      imageSrc=\"./_images/placement-1.svg\"\n      caption=\"Global notification\" \n    />\n  </div>\n</Grid2Cols>\n\n<br />\n<Grid2Cols>\n  <div>\n    <h3 style=\"margin-top: 0;\">Inline notificaton </h3>\n    <p>Notifications can also be placed inline within the page and is usally related to the specific section of the page or application. This kind of notifcations because of it placement usually have less urgency than the global notification. </p>\n    <h4>Cases where an inline Notification is a good choice:</h4>\n    <ul>\n      <li>Warning about information being internal only.</li>\n      <li>Communicate outdated information or delays.</li>\n      <li>Additional contextual information that is relevant to a specific section of the page or application.</li>\n    </ul>\n  </div>\n  <div>\n    <br />\n    <Example \n      imageSrc=\"./_images/placement-2.svg\"\n      caption=\"Inline notification\" \n    />\n  </div>\n</Grid2Cols>\n\n## Appearance\n\nUse the different colour appearances and icons to clearly communicate the severity of the message.\n\n<Example \n  imageSrc=\"./_images/appearance-1.svg\"\n  caption=\"Use for more general information about changes in the application e.g. announcements about product updates.\"\n/>\n\n<Example \n  imageSrc=\"./_images/appearance-2.svg\"\n  caption=\"Use success notifications when a task or a process has successfully been completed.\"\n/>\n\n<Example \n  imageSrc=\"./_images/appearance-3.svg\"\n  caption=\"Use warning when something in the application has changed that is important that the user is aware about.\"\n/>\n\n<Example \n  imageSrc=\"./_images/appearance-4.svg\"\n  caption=\"Use for cases where an error has occured within the application that demands immediate attention.\"\n/>\n\n\n## Content\n\nAlways make sure that the user can read and understand the notification message within a few seconds. Keep the message short and use the words that people are familiar with.\n\nWhen a notification component takes the full width of the page, make sure to break long feedback messages into several lines. This will prevent degrading the reading experience on very wide screens.\n\n## Actions\n\nThe recommended (default) placement for actions (<PageLink path=\"/components/button\">Buttons</PageLink> or <PageLink path=\"/components/link\">Links</PageLink>) is under the feedback message. That allows for actions to stay close to the description which gives context to people independently of how wide the notification component expands in the viewport.\n\n<Example \n  imageSrc=\"./_images/actions-1.svg\"\n  caption=\"Action placed inline with the feedback message.\"\n/>\n\nIt is also possible to display actions inline. If you use inline actions keep in mind they could become visually separated from the feedback message that might be providing important context for the user.\n\n<Example \n  imageSrc=\"./_images/actions-2.svg\"\n  caption=\"Action below the feedback message.\"\n/>\n\n## Permanence\n\nNotifications can be either permanent or discardable\n\n<Example \n  imageSrc=\"./_images/permanence.svg\"\n  caption=\"Global warning notification that is discardable.\"\n/>\n"
}