{
  "timestamp": 1752222433045,
  "data": "---\ntags:\n  - core\n  - form\n  - field\n  - option\n  - select\ntitle: Radio\ndescription: >-\n  Radio buttons are mutual exclusive, which means that there should always be at\n  least two radio buttons grouped together.\n---\n\nimport RadioDemo from \"./_components/RadioDemo.vue\";\n\n<RadioDemo client:only=\"vue\" />\n\n## Best practice\n\n- Use radio buttons when the user can only select one option out of 6 or less options.\n- For doing multi-selection from 6 or less options use <PageLink path=\"/components/checkbox\">checkboxes</PageLink>. Check our recommendations for all <PageLink path=\"/guidelines/selection-components\">selection components</PageLink>.\n- Use <code>&lt;fieldset&gt;</code> and <code>&lt;legend&gt;</code> to group radio buttons and give them a label.\n- The legend should describe what to input and not how.\n- Use natural language and use the terms that the user would expect.\n- Don't use verbs like enter, add, input etc in the legend.\n- Don't add a colon ( : ) at the end of the legend.\n- Use the hint text to provide additional context and explanation.\n\n<Notification>\nWe recommend reading the <PageLink path=\"/guidelines/forms\">forms</PageLink>, <PageLink path=\"/guidelines/selection-components\">selection components</PageLink> and <PageLink path=\"/content/labels\">label</PageLink> guidelines.\n</Notification>\n\n## Grouping\n\nBy default, the radio button group is vertically aligned, but the component also supports a horizontally aligned radio button group. Since horizontal groups are more difficult to scan, we always recommend using vertically aligned radio button groups wherever possible. Always use the vertical group in forms. Read more about forms <PageLink path=\"/guidelines/forms#grouping\">here</PageLink>.\n\n<Example\n  imageSrc=\"./_images/grouping-1.svg\" \n  caption=\"Vertical radio button group.\"\n/>\n\n<Example\n  imageSrc=\"./_images/grouping-2.svg\" \n  caption=\"Horizontal checkbox group.\"\n/>\n\n## Hint text\n\nUse the hint text to provide information that makes it easier for the user to select the right option. For a group of radio buttons help text is placed above the radio buttons and below the label (&lt;legend&gt;).\n\n<Example\n  imageSrc=\"./_images/hint-text.svg\" \n/>\n\n\nFor more information on help text and help in general see our <PageLink path=\"/guidelines/forms#help\">form design guidelines</PageLink>.\n\n## Error state\n\nAn invalid group of radio buttons is highlighted with a red error message placed above the radio buttons and below the label (&lt;legend&gt;). Error messages should be clear, concise and provide actionable remedies to resolve the errors.\n\n<Example\n  imageSrc=\"./_images/error-state.svg\" \n/>\n"
}