{
  "timestamp": 1752222428323,
  "data": "---\ntags:\n  - core\n  - form\n  - time\n  - year\n  - month\n  - day\n  - calendar\n  - picker\n  - field\ntitle: Input Date\ndescription: >-\n  The input date allows people to input a single date.\nrelatedPages:\n  - /components/calendar/\n  - /components/date-range/\n---\n\nimport InputDateDemo from \"./_components/InputDateDemo.vue\";\n\n<InputDateDemo client:only=\"vue\" />\n\n## Best practice\n\n- Make it clear what kind of date format (YYYY-MM-DD) you are asking for. e.g. _by using placeholder_.\n- When asking for a date from official document e.g. _passport_, match the input format of the original, so that it is easy for the user to copy.\n- Use min and max dates to help prevent user error. The selectable date should be realistic for the context and application capabilities.\n- When asking for a memorable date (e.g. date of birth) consider using 3 text inputs to represent the correct format.\n- Display the weeks numbers in the <PageLink path=\"/components/calendar\">calendar</PageLink> popover only when the context requires it and when users expect to see them by default.\n- If you need to combine date and time use the <PageLink path=\"/components/input-time\">input time</PageLink> as addition to the input date.\n- Use understandable and contextual language for the input label that describes what the date is for.\n- Don't use verbs like enter, add, input etc in the label.\n- Don't add a colon ( : ) at the end of the label.\n- Use the hint text to provide additional context and explanation.\n\n<Notification>\nWe recommend that you read our <PageLink path=\"/guidelines/forms\">Form Guidelines</PageLink>. The Guidelines cover many basic recommendations to be taken into consideration when working with forms.\n</Notification>\n\n## Label\n\nBy default, the component has a top-positioned label. It is possible to change the position of the label to be left-positioned. We recommend that you use the top-positioned labels wherever possible, especially in forms. You can read more about why we recommend top-positioned labels in our <PageLink path=\"/guidelines/forms/#label-positioning\">form guidelines</PageLink>.\n\nFor information on how to write good and consistent labels - see our <PageLink path=\"/content/labels/#form-field-labels\">Label Guidelines</PageLink>.\n\n## Hint text & error state\n\nPlease see the <PageLink path=\"/components/input\">Input component</PageLink> for details on <PageLink path=\"/components/input#hint-text\">hint text</PageLink> and <PageLink path=\"/components/input#error-state\">error state</PageLink>.\n\n## Vanity variant\n\nThe component supports the \"vanity\" style variant. \n\nPlease read more about this variant on our <PageLink path=\"/guidelines/forms#vanity-field-variant\">form guidelines page</PageLink>.\n\n## Examples\n\nCommon scenarios of how this component could be used.\n\n### Date and time together\n\nThe following example uses the <PageLink path=\"/components/input-time\">input time component</PageLink> for date and time input.\n\n<Example\n  imageSrc=\"./_images/example.svg\"\n  caption=\"When time needs to be related to a specific date.\"\n/>\n\n\n"
}