{
  "timestamp": 1752222433342,
  "data": "---\ntags:\n  - core\n  - switcher\n  - tab\n  - select\n  - filter\n  - search\n  - toolbar\n  - view\n  - toggle\ntitle: Segmented Control\ndescription: >-\n  Groups multiple selectable options for displaying different views of the same content. \nrelatedPages:\n  - /components/button-group/\n  - /components/tabs/\n  - /guidelines/selection-components/\nrenderAllChildPagesAsTabs: true\n---\n\nimport SegmentedControlDemo from \"./_components/SegmentedControlDemo.vue\";\n\n<SegmentedControlDemo client:only=\"vue\" />\n\n## Best practice\n\n#### Do:\n\n- Use the Segmented Control to select and segment the content displayed.\n- Use the Segmented Control for switching between binary views e.g. showing a bar or a line chart.\n- Show the outcome immediately after selection e.g. changing from card view to list view.\n- Limit segments to 4-5 options. Limiting ensures all segments are clearly visible across different screen sizes.\n- Keep labels short and with clear meaning.\n\n#### Do not:\n- Do not use the Segmented Control to navigate content within the same page context. Use the <PageLink path=\"/components/tabs/\">Tabs</PageLink> component instead.\n- Do not use the Segmented Control for binary actions e.g. switching a feature on and off. The <PageLink path=\"/components/switch/\">Switch</PageLink> component is ideal for this.\n- Do not use the Segmented Control to collect user input in forms. Please check the <PageLink path=\"/guidelines/selection-components/\">Selection components</PageLink> guideline.\n\n## Usage\n\nSegmented Controls are ideal for changing the view on content within a single context e.g. changing grid view to list view. \n\nThe Segmented Control is helpful in creating layouts with a cleaner interface and information hierarchy and can work well in combination with the  <PageLink path=\"/components/tabs/\">Tabs</PageLink> component. \n\nUse the Segmented Control to narrow down what is visible in order to make content more digestible.\n\nDo not use the Segmented Control or actions or to navigate to different pages. In this instance, consider using the <PageLink path=\"/components/button/\">Button</PageLink>, and <PageLink path=\"/components/button-group/\">Button Group</PageLink>  for actions or <PageLink path=\"/components/tabs/\">Tabs</PageLink> if you need users to navigate to different content.\n\n\n### Filter available content\n\nThe Segmented Control is ideal for switching what content is visible in a list or a table. It can act as a quick filter to help users digest the available content faster. \n\n<Example\n  imageSrc=\"./_images/filter-available-content.svg\"\n  caption=\"An example of using the Segmented Control to provide a quick content filter.\"\n/>\n\n### Control view modes\n\nThe Segmented Control can be used to enable users to look at the same content in different presentation modes. It is a useful way of tailoring information for different types of users and mental models. \n\n<Example\n  imageSrc=\"./_images/control-view-modes.svg\"\n  caption=\"An example of using the Segmented Control to switch between different chart types.\"\n/>\n\n### Small viewport\n\nWhen using the Segmented Control to segment content in small viewports like mobile devices or sidebars, use full width for the best alignment with the related content and surrounding UI elements. \n\n<Grid2Cols>\n  <Example\n    imageSrc=\"./_images/small-viewports-do.svg\"\n    indicator=\"success\"\n  />\n  <Example\n    imageSrc=\"./_images/small-viewports-caution.svg\"\n    indicator=\"warning\"\n  />\n</Grid2Cols>\n\n### Placement\n\nAlways place a Segmented Control in close proximity to the content area that will be impacted by it. This creates a clear hierarchy. \n\n<Grid2Cols>\n  <Example\n    imageSrc=\"./_images/placement-do.svg\"\n    indicator=\"success\"\n  />\n  <Example\n    imageSrc=\"./_images/placement-dont.svg\"\n    indicator=\"error\"\n  />\n</Grid2Cols>\n"
}