{
  "timestamp": 1752222431004,
  "data": "---\ntags:\n  - core\n  - select\n  - form\n  - option\ntitle: Multi-Select\ndescription: >-\n  The Multi-Select allows users to select one or more items from a list of options.\nrenderAllChildPagesAsTabs: true\n---\n\nimport MultiSelectDemo from \"./_components/MultiSelectDemo.vue\";\n\n<MultiSelectDemo client:only=\"vue\" />\n\n## Best practice\n\n- Use Multi-Select to allow for the selection of multiple options from medium to long lists.\n- Use a single word or a concise sentence as options\n- The Multi-Select and the options popover should have the same width.\n- When grouping options, ensure the groups are logical and helpful to the user.\n- The label should describe what the user is selecting. Check the <PageLink path=\"/content/labels\">Label Guidelines</PageLink>.\n- Use the help text to provide additional context and explanation.\n- Use <PageLink path=\"/components/checkbox\">Checkboxes</PageLink> if there are six options or fewer, unless it negatively impacts the UI layout.\n- If the list has more than 10-15 options, then activate the search functionality.\n- Use the <PageLink path=\"/components/typeahead-multi-select\">Typeahead Multi-Select</PageLink> instead, if the list of options is very long. \n\n## Search\nIn cases where the list of options is longer than 10-15, it is recommended to activate the search functionality in the drop-down list. The longer the list the more difficult it becomes for the user to scan the options, but already when the list is between 10-15 options, the ability scan slows down. In such cases, a search can be a great way to speed up the process of finding the right option(s).\n\n<Example \n  imageSrc=\"./_images/multi-select-search.svg\"\n  caption=\"Use the search to filter the list of options.\"\n/>\n\n<Notification appearance=\"info\" heading=\"Difference between Search in Multi-Select and Typeahead Multi-Select\">\nBoth components allow users to search and select multiple options from a list, but they serve different use cases and user behaviours. Read about the differences in the <PageLink path=\"/guidelines/selection-components\">Selection Components Guidelines</PageLink>.\n</Notification>\n\n\n## Grouping options\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/grouping-1.svg\"\n    caption=\"Grouping with headlines creates visual hierarchy that allows users to scan the options.\" \n  />\n  <Example \n    imageSrc=\"./_images/grouping-2.svg\"\n    caption=\"Horizontal dividers can be used on their own or to emphasise the end of each grouping section.\" \n  />\n</Grid2Cols>\n\n\n## Clearing a selection\n\nThe Multi-Select offers two ways of clearing an already-made selection. The default way displays an additional “Clear all” option on top of the list that removes the selection and returns the field to its default state.\n\nMulti-Select also supports an icon action in the input field. It allows users to interact with it by clicking, touching, or using the backspace key on the keyboard to remove an existing selection. It must be enabled intentionally and used for short forms or single multi-select fields.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/clearing-1.svg\"\n    caption=\"The default clear pattern is well recognised and suitable in any context, including high-density interface and long forms.\" \n  />\n  <Example \n    imageSrc=\"./_images/clearing-2.svg\"\n    caption=\"Use a clear button only for short forms or single fields. Otherwise, it will increase visual noise, which could increase cognitive load/\"\n  />\n</Grid2Cols>\n\n\n## Label\n\nBy default, the component has a top-positioned label. It is possible to change the position of the label to be left-positioned. We recommend that you use the top-positioned labels wherever possible, especially in forms. You can read more about why we recommend top-positioned labels in our <PageLink path=\"/guidelines/forms/#label-positioning\">Form Guidelines</PageLink>.\n\nFor information on how to write good and consistent labels - see our <PageLink path=\"/content/labels/#form-field-labels\">Label Guidelines</PageLink>.\n\n\n## Hint text & error state\n\nPlease see the <PageLink path=\"/components/input\">Input component</PageLink> for details on <PageLink path=\"/components/input#hint-text\">hint text</PageLink> and <PageLink path=\"/components/input#error-state\">error state</PageLink>.\n\n\n## Vanity variant\n\nThe component supports the \"vanity\" style variant. \n\nPlease read more about this variant in our <PageLink path=\"/guidelines/forms#vanity-field-variant\">Form Guidelines</PageLink>.\n\n"
}