{
  "timestamp": 1752222427203,
  "data": "---\ntitle: Drawer\ndescription: A drawer, also known as a slide-out panel is used for secondary content and functionality.\ntags:\n- core\n- panel\n- overlay\n- slide-out\n- slide-in\n- off-canvas\n- layout\n---\n\nimport DrawerDemo from \"./_components/DrawerDemo.vue\";\n\n<DrawerDemo client:only=\"vue\" />\n\n## Best practice\n\n- Use drawers for menus, settings, filters and contextual options. \n- Position the drawer consistently across the website or application.\n- Don’t overload the drawer, keep the content simple and focused.\n- Don’t use a drawer as the primary navigation on desktop.\n- Avoid using the bottom drawer on desktop.\n\n## Usage \n\nUse the drawer for secondary content and functionality that do not have to be visible at all times. \nThe most common use cases are menus, settings, filters, contextual actions and tools. \nDrawers can also be used for temporary content such as notifications and chats.\n\nDrawers help save space and create a cleaner UI by hiding secondary information. Avoid using drawers for primary navigation in desktop applications if space allows for a more permanent sidebar or header navigation.\n\n<Notification>\nThe drawer should not be confused with a persistent sidebar. The drawer is an overlay that can be opened and closed, whereas a sidebar is persistent part of the page. \nA sidebar component is on our backlog for Q1 2025 as a part of a wider page layout work.\n</Notification>\n\n## Placement\n\nDrawers are typically placed on the left or right side of the screen, but can also be placed in the top or the bottom of the screen. \n\nEnsure that the same type of drawer is placed consistently across the website or application.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/placement-1.svg\"\n    caption=\"Drawer placed to the right.\" \n  />\n  <Example \n    imageSrc=\"./_images/placement-2.svg\"\n    caption=\"Drawer placed to the left.\" \n  />\n  <Example \n    imageSrc=\"./_images/placement-3.svg\"\n    caption=\"Drawer placed to the bottom.\" \n  />\n  <Example \n    imageSrc=\"./_images/placement-4.svg\"\n    caption=\"Drawer placed to the top.\"\n  />\n</Grid2Cols>\n\n## Content\n\nEnsure the content inside the drawer is well-organized and scannable. Use headings, dividers, or sections to break up content logically. \nOnly include the information necessary for the task at hand e.g., menu items, filters.\n\n<Example \n  imageSrc=\"./_images/content.svg\"\n  caption=\"Example of well-organized content in the drawer.\" \n/>\n\n## Non-modal drawer\n\nBy default, the drawer is in modal state, which means that while the drawer is opened it has a backdrop and the user cannot interact with the rest of the page. \nIn some cases, the user still needs to be able to interact with the rest of the page, in such cases the drawer can be made non-modal. \n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/non-modal-1.svg\"\n    caption=\"Modal drawer.\" \n  />\n  <Example \n    imageSrc=\"./_images/non-modal-2.svg\"\n    caption=\"Non-modal drawer.\" \n  />\n</Grid2Cols>"
}