{
  "timestamp": 1752222426225,
  "data": "---\ntags:\n  - core\n  - form\n  - field\n  - option\n  - select\ntitle: Checkbox\ndescription: >-\n  Checkboxes allow users to select one or more choices from a list of options.\nrenderAllChildPagesAsTabs: true\n---\n\nimport CheckboxDemo from \"./_components/CheckboxDemo.vue\";\n\n<CheckboxDemo client:only=\"vue\" />\n\n## Best practice\n\n- Use checkbox groups for 6 or less selectable options. Check our recommendations for all <PageLink path=\"/guidelines/selection-components\">selection components</PageLink>.\n- Do not pre-select checkbox options, this might cause users to submit a wrong answer.\n- If the user can only choose one option of a selection, use <PageLink path=\"/components/radio\">radio buttons</PageLink> instead.\n- Use <code>&lt;fieldset&gt;</code> and <code>&lt;legend&gt;</code> to group checkboxes and give them a label.\n- Be explicit when the user can select more than one option e.g. use hint text \"Select all that apply\".\n- The legend (or label with a single checkbox) should describe what to input and not how.\n- Use natural language and use the terms that the user would expect.\n- Don't use verbs like enter, add, input etc in the legend/label.\n- Don't add a colon ( : ) at the end of the legend.\n- Use the hint text to provide additional context and explanation.\n\n<Notification>\nWe recommend reading the <PageLink path=\"/guidelines/forms/\">forms</PageLink>, <PageLink path=\"/guidelines/selection-components\">selection components</PageLink> and <PageLink path=\"/content/labels/\">label</PageLink> guidelines.\n</Notification>\n\n## Grouping\n\nBy default, the checkbox group is vertically aligned, but the component also supports a horizontally aligned checkbox group. Since horizontal groups are more difficult to scan we always recommend using vertically aligned checkbox groups wherever possible. Always use the vertical group in forms. Read more about grouping in forms in our <PageLink path=\"/guidelines/forms#grouping\">Form Guidelines</PageLink>.\n\n<Example\n  class=\"mb-6\"\n  imageSrc=\"./_images/grouping-1.svg\"\n  caption=\"Vertical checkbox group.\"\n/>\n\n<Example\n  imageSrc=\"./_images/grouping-2.svg\"\n  caption=\"Vertical checkbox group.\"\n/>\n\n## Hint text\n\nUse the hint text to provide information that makes it easier for the user to select the right options.\n\n<Example\n  imageSrc=\"./_images/hint-text-1.svg\"\n  caption=\"Using a single select button group to collect user feedback from your application.\"\n/>\n\nFor a group of checkboxes the hint text is placed above the checkboxes and below the label (&lt;legend&gt;).\n\n<Example\n  imageSrc=\"./_images/hint-text-2.svg\"\n  caption=\"Using a single select button group to collect user feedback from your application.\"\n/>\n\nFor more information on hint text and help in general see our <PageLink path=\"/guidelines/forms#help\">form design guidelines</PageLink>.\n\n## Error state\n\nAn invalid checkbox is highlighted with a red border and a red error message below.\n\n<Example\n  imageSrc=\"./_images/error-state-1.svg\"\n/>\n\nA group of checkboxes are highlighted with a red error message above the checkboxes. Error messages should be clear, concise and provide actionable remedies to resolve the errors.\n\n<Example\n  imageSrc=\"./_images/error-state-2.svg\"\n/>\n\n"
}