{
  "timestamp": 1752222431715,
  "data": "---\ntags:\n  - core\n  - form\n  - field\ntitle: Number Stepper\ndescription: >-\n  A number stepper allows the user to pick a small number by increasing,\n  decreasing or entering a numerical value.\n---\n\nimport NumberStepperDemo from \"./_components/NumberStepperDemo.vue\";\n\n<NumberStepperDemo client:only=\"vue\" />\n\n## Best practice\n\n- Use a number stepper when the expected input is a fairly small whole number.\n- Choose an appropriate default value based on the use case.\n- Carefully consider and define the appropriate range (and step) of valid entries.\n- Provide a short and meaningful label letting the user know what they are changing the value of.\n- The label should describe what to input and not how.\n- Use natural language and use the terms that the user would expect.\n- Don't use verbs like enter, add, input etc in the label.\n- Don't add a colon ( : ) at the end of the label.\n- Use the help text to provide additional context and explanation.\n\n<Notification>\nWe recommend that you read our <PageLink path=\"/guidelines/forms\">form design guidelines</PageLink>. The Guidelines cover many basic recommendations to be taken into consideration when working with forms.\n</Notification>\n\n## When to use\n\nOnly use a number stepper if the expected input:\n\n- Is a fairly small whole number (i.e. 0-10)\n- Doesn’t contain letters, slashes, minus signs, decimal points and does not have a leading zero\n\nIn any other case it's safer to use a <PageLink path=\"/components/input\">regular text input field</PageLink> and possibly adding [the 'pattern' attribute’](https://stackoverflow.com/questions/6178556/phone-numeric-keyboard-for-text-input/6512618#6512618) to trigger the numeric keyboard on iOS.\n\n<Grid2Cols>\n  <Example \n    indicator=\"success\" \n    isFullWidth={true}\n  >\n    <div class=\"min-h-48\">\n      <div><strong>Do use</strong> the number stepper for numbers like this:</div>\n      <ul style=\"margin-bottom: 0px;\">\n        <li>1</li>\n        <li>3</li>\n        <li>7</li>\n        <li>0</li>\n      </ul>\n    </div>\n  </Example>\n  <Example \n    indicator=\"error\" \n    isFullWidth={true}\n  >\n    <div class=\"min-h-48\">\n      <div><strong>Do not use</strong> the number stepper for these types of numbers/numerals:</div>\n      <ul style=\"margin-bottom: 0px;\">\n        <li>01</li>\n        <li>-5</li>\n        <li>12.5</li>\n        <li>1250</li>\n      </ul>\n    </div>\n  </Example>\n</Grid2Cols>\n\n## Default value\n\nThe number stepper should always have a default value. Depending on the context this could be:\n\n- 0\n- 1\n- The most frequently entered value\n\n## Range & step\n\nBy default the stepper allows a user to enter a value in the range between 0 (min) and 10 (max) with increments of 1 (step). However, these can be adjusted to fit the use case at hand.\n\n### Min (minimum)\n\nDefines the smallest valid entry (min is usually 0 or 1).\n\n### Max (maximum)\n\nDefines the largest valid entry. Make sure not to restrict large entries if there's even a small probability of users wanting to choose a large value.\n\n### Step\n\nDefines the valid values within the range and determines the increment with which the value will change when the user presses the buttons (step is usually 1).\n\n<Notification appearance=\"warning\">\nChanging the step to anything other than 1 (e.g. 0.1 or 50) can lead to usability issues since users:\n\n- Won't know what to expect up front.\n- Might have to press the buttons many times to reach the desired value.\n- Might want to enter a value between the steps.\n</Notification>\n\n## Label\n\nBy default, the component has a top-positioned label. It is possible to change the position of the label to be left-positioned. We recommend that you use the top-positioned labels wherever possible, especially in forms. You can read more about why we recommend top-positioned labels in our <PageLink path=\"/guidelines/forms/#label-positioning\">form guidelines</PageLink>.\n\nFor information on how to write good and consistent labels - see our <PageLink path=\"/content/labels/#form-field-labels\">Label Guidelines</PageLink>.\n"
}