{
  "timestamp": 1752222424753,
  "data": "---\ntitle: Breadcrumb\ndescription: A breadcrumb is a secondary navigation component used to show users their location within a website or application hierarchy.\ntags:\n- core\n- navigation\n- hierachy\n- structure\n- path\n- canonical urls \n---\n\nimport BreadcrumbDemo from \"./_components/BreadcrumbDemo.vue\";\n\n<BreadcrumbDemo client:only=\"vue\" />\n\n\n## Best practice\n\n- Use breadcrumbs to give context and help users navigate.\n- All breadcrumbs items except the current page should be clickable links.\n- Use concise and descriptive link text for each level in the breadcrumb. \n- Avoid using dynamic or changing breadcrumbs, since it can confuse users. \n- Use truncation if the breadcrumb has more than 5 levels.\n- The breadcrumb should never wrap to the second line.\n- Place the breadcrumb consistently on each page across the website or application. \n- Don’t use a breadcrumb for simple and flat hierarchies e.g. a 2 level hierachy.\n\n\n## Usage\n\nBreadcrumbs should provide context and an easy way for users to navigate up the site hierarchy. They are not intended to replace primary navigation but to enhance the user’s understanding of where they are within the website or application. Use a breadcrumb for applications with a hierarchy of more than 2 levels. \n\n\n## Placement \n\nAlways place the breadcrumb horizontally and at the top of the page. If possible place the breadcrumb above the page title or primary content and below the global navigation or header. Always place the breadcrumb at the same position on each page across the website or application. By doing so we ensure that the user can find the breadcrumb easily. \n\n<Example \n  imageSrc=\"./_images/placement.svg\"\n  indicator=\"success\" \n  caption=\"Place the breadcrumb between header and main content.\" \n/>\n\n\n## Writing link text \n\nTo make it as easy as possible for the user to understand and navigate through the breadcrumb each link text should be short and consise.  \n\n<Example \n  imageSrc=\"./_images/writing-link-text-do.svg\"\n  indicator=\"success\" \n  caption=\"Always aim for short and concise link texts.\"\n />\n\n<Example \n  imageSrc=\"./_images/writing-link-text-dont.svg\"\n  indicator=\"error\" \n  caption=\"Avoid long and unclear link texts.\" \n/>\n\n\n## Home icon \n\nAs default, we recommend using text for “home”, but it is possible to use a home icon (house icon) instead. If home is the current page, then it is not a link, but in all other cases, it is an interactive link. \n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/home-icon-1.svg\" \n    caption=\"The home link as text.\" \n  />\n  <Example \n    imageSrc=\"./_images/home-icon-2.svg\" \n    caption=\"The home link as icon.\" \n  />\n</Grid2Cols>\n\n\n## Current page\n\nAs a default, the current page is a part of the breadcrumb. It is not an interactive link, but normal text. It is possible to remove the current page so that the previous page is the last item in the breadcrumb. This might be useful where you have the page title just underneath the breadcrumb as a natural extension of the breadcrumb.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/current-page-1.svg\"\n    caption=\"The breadcrumb includes the current page as default.\"\n  />\n  <Example \n    imageSrc=\"./_images/current-page-2.svg\"\n    caption=\"You can remove the current page, if needed.\"\n  />\n</Grid2Cols>\n\n\n## Depth & truncation\n\nIt is recommended to limit the breadcrumb to 3-5 levels. If the website or application has a deeper hierarchy or is too long, then use truncation. \nDisplaying more than 5 levels will make it hard for the user to comprehend the structure and in most cases there also starts to be a problem with space. \n\nWhen truncated the breadcrumb only shows the first and the last two levels and the levels in between is replaced by an ellipsis. \n\n<Example \n  imageSrc=\"./_images/depth-and-truncation-do.svg\"\n  indicator=\"success\" \n  caption=\"Truncate the breadcrumb if it has more than 3-5 levels.\" \n/>\n\n<Example \n  imageSrc=\"./_images/depth-and-truncation-dont.svg\"\n  indicator=\"error\" \n  caption=\"Don't show all levels if the breadcrumb has more than 5 levels.\" \n/>\n\n\n## Mobile & responsive design\n\nOn mobile (breakpoint x-small), we have to take extra care, since the space is limited and the breadcrumb might wrap and take multiple lines. This should be avoided and in such cases, it is recommended to use truncation and also check if the link texts can be done shorter without losing their meaning. \n\n\n## Canonical URLs\n\nA canonical URL is the URL of the best representative page from a group of duplicate pages. For example, if you have 2 URLs for the same page – example.com?dress=1234 and example.com/dresses/1234 – then Google chooses one as canonical. \n\nBreadcrumb should reflect the same hierarchy as your canonical URLs. In other words, if you have multiple URLs pointing to the same page e.g. through parameters or dynamic URLs, then make sure that the canonical version is the URL used in the breadcrumb. This helps prevent SEO issues caused by duplicated content. \n\nAn example of this could be pages that differ only by the sorting or filtering of the content e.g. sorted by lowest price. Google will group these slightly different pages and make the most representative page the canonical URL.\n"
}