{
  "timestamp": 1752222436413,
  "data": "---\ntags:\n  - core\n  - form\n  - field\ntitle: Textarea\ndescription: >-\n  The textarea component is similar to the text input but allows user to enter\n  multiple lines of text.\n---\n\nimport TextareaDemo from \"./_components/TextareaDemo.vue\";\n\n<TextareaDemo client:only=\"vue\" />\n\n## Best practice\n\n- Use natural language when writing form labels.\n- Use the help text to show the character count and place it to the right.\n- Error messages should be clear, concise and should provide actionable remedies to resolve the errors.\n- The label should describe what to input and not how.\n- Use natural language and use the terms that the user would expect.\n- Don't use verbs like enter, add, input etc in the label.\n- Don't add a colon ( : ) at the end of the label.\n- Use the help text to provide additional context and explanation.\n\n<Notification>\nWe recommend that you read our <PageLink path=\"/guidelines/forms\">form design guidelines</PageLink>. The Guidelines cover many basic recommendations to be taken into consideration when working with forms.\n</Notification>\n\n## Label\n\nBy default, the component has a top-positioned label. It is possible to change the position of the label to be left-positioned. We recommend that you use the top-positioned labels wherever possible, especially in forms. You can read more about why we recommend top-positioned labels in our <PageLink path=\"/guidelines/forms/#label-positioning\">form guidelines</PageLink>.\n\nFor information on how to write good and consistent labels - see our <PageLink path=\"/content/labels/#form-field-labels\">Label Guidelines</PageLink>.\n\n## Placeholder\n\nDo not use the placeholder to replace labels. Unlike labels, placeholder text is optional and should be used with care since it disappears when the user starts typing. If the information is crucial, then use the hint text instead.\n\n## Max length counter\n\nUse the max length counter to provide the user with information on how many characters the textarea accepts as well as giving the user immediate feedback on how many characters that has been entered as they type.\n\n<Example\n  imageSrc=\"./_images/max-length-counter.svg\"\n/>\n\n## Hint text & error state\n\nPlease see the <PageLink path=\"/components/input\">Input component</PageLink> for details on hint text and error state.\n\nFor more information on hint text and help in general see our <PageLink path=\"/guidelines/forms#help\">form design guidelines</PageLink>.\n"
}