{
  "timestamp": 1752222426993,
  "data": "---\ntags:\n  - core\n  - popup\ntitle: Dialog\ndescription: >-\n  A Dialog is a disruptive overlay that requires the user to make a decision before proceeding further.\n---\n\nimport DialogDemo from \"./_components/DialogDemo.vue\";\n\n<br />\n\n<DialogDemo client:only=\"vue\" />\n\n\n## Best practice\n- Dialogs are inherently disruptive, so use them sparingly.\n- Use dialogs to display messages of high-urgency.\n- Use dialogs in cases that require a decision or acknowledgement from the user. \n- Keep the dialog messages short and concise. \n- Avoid ambigious and vague copy to minimise mistakes.\n\n<Notification>\nIf you need to display low-urgency feedback that is mainly task-triggered, then use the <PageLink path=\"/components/toast\">Toast component</PageLink>. For mid to high-urgency feedback and for feedback that needs to be persistant, use the <PageLink path=\"/components/notification\">Notification component</PageLink>.\n\nSee our <PageLink path=\"/guidelines/system-feedback\">System Feedback Guidelines</PageLink> for more information on system feedback in general.\n</Notification>\n\n\n## Placement\nDialogs are placed in the centre of the viewport and on top of everything else in the UI, this is done to ensure the user's full attention. While the dialog is active, a backdrop (scrim) is rendered underneath and the rest of the UI is inaccessible until the user clicks on one of the actions in the dialog or dismisses it by pressing ESC.\n\nTo see the dialog with the backdrop, click on the \"Click to see dialog\" button in the demo section in the top of the page.\n\n\n## Usage \nDialogs should be used in cases with high-urgency and/or where the user is required to take action to proceed, e.g. confirmation or acknowledgement. Be mindful of the dialog's disruptive nature and ensure they are needed in your specific use case. \n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/usage-1.svg\"\n    indicator=\"success\" \n    caption=\"Use the dialog to ask the user to confirm any destructive action.\"\n  />\n  <Example \n    imageSrc=\"./_images/usage-2.svg\"\n    indicator=\"error\" \n    caption=\"Don't use the dialog for low-urgency information and where no acknowledgement is needed.\"\n  />\n  <Example \n    imageSrc=\"./_images/usage-3.svg\"\n    indicator=\"success\" \n    caption=\"Ask the user for confirmation on things they likely have forgotten.\"\n  />\n  <Example \n    imageSrc=\"./_images/usage-4.svg\"\n    indicator=\"error\" \n    caption=\"Don't confuse the user with vague micro-copy e.g. yes/no button labels.\"\n  />\n</Grid2Cols>"
}