{
  "timestamp": 1752222501540,
  "data": "---\ntitle: Content\ndescription: Writing brand aligned, carefully considered content for digital products.\ncontributors:\n  - silvia-la-face\n  - julie-bang\nchildPageOrder:\n  - writing-with-ai\n  - currency-and-pricing\n  - date-and-time\n  - error-messages\n  - labels\n  - numbers\n  - glossary\n  - tone-of-voice\n  - truncation\n---\n\nIn this section, you will find principles and best practices for writing clear, concise, and user-friendly microcopy.  \n\nTo write effective short text, such as error messages, button labels, notifications, call-to-actions, instructions, and more, you must lead with the benefits for the user.   \n\nFor example: “Save time by using our quick booking.” Note that benefits are different from features. Features are part of how a product works, but benefits are how the features help the user. \n\n### Best practices \n\n- Use simple language for clarity and ease of understanding. \n- Keep text short, removing unnecessary words without losing essential information. \n- Maintain consistent terminology and style, following brand guidelines for [tone and voice](https://brandcentral.maersk.com/document/1016#/-/writing:32710). \n- Provide relevant information based on the user's current context and needs. \n- Anticipate user questions and provide answers proactively. \n- Use verbs for actionable text, e.g., \"Save updates,\" \"Pay,\" or \"Learn more.\" \n- Follow [brand guidelines](https://brandcentral.maersk.com/) and use sentence case for all text except [industry terms](https://www.maersk.com/support/glossaries/), which use title case (e.g., Bill of Lading). \n- Use British English as the official default language. \n- Avoid disclosing personal identifiable information (PII) to ensure user privacy and security. \n\nFollowing these practices will ensure better clarity, consistency, and user privacy. \n\nExplore each section for in-depth guidelines and examples to help you write effective and coherent product microcopy.  \n\nNeed help with your microcopy? Raise your issue in the [UX Writing chat](https://teams.microsoft.com/l/channel/19%3A326a1c086d77416fa34afb3577bec741%40thread.skype/UX%20Writing%20-%20Copywriting?groupId=f5d54b22-e886-4278-98df-d9aadca2040a&tenantId=05d75c05-fa1a-42e7-9cf1-eb416c396f2d). \n\n### Accessibility \n\nIn addition to the Maersk Design System's <PageLink path=\"/guidelines/accessibility/\">Accessibility Guidelines</PageLink>, Brand Management also offers guidance on how to make content accessible on [Brand Central](https://brandcentral.maersk.com/document/1018#/accessibility-guidelines/accessibility-guidelines).\n"
}