{
  "timestamp": 1752222501030,
  "data": "---\ntitle: Error messages\ndescription: Concise and precise error messages can help the user recover from errors quickly and painlessly.\ncontributors:\n  - silvia-la-face\n  - julie-bang\n---\n\n## General considerations\nThe best error message is the one that never gets written, as errors throughout Maersk products and platforms should be prevented by proactively informing the user of relevant information. For this reason, it pays to be prepared and support our customers. \n\n### Proximity \nAs an overall rule, always provide information and guidance on what the error is and how to solve it close to where the problem happens. \n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/proximity-do.svg\"\n    caption=\"Always place the error message close to where the error occurs.\"\n    indicator=\"success\"\n  />\n  <Example \n    imageSrc=\"./_images/proximity-dont.svg\"\n    caption=\"Avoid displaying the error message away from where the error occurs.\"\n    indicator=\"warning\"\n  />\n</Grid2Cols>\n\n<Notification heading=\"Errors in forms\">\nIn longer forms, it can be helpful to display an error summary at the top of the form, so that the user easily can get an overview of what error needs fixing. This doesn’t replace the error messages underneath the erroneous input fields but should be seen as additional help.\n</Notification>\n\n\n### Severity & urgency\n\nIt is important that the user understands the severity and urgency of the error and knows if the issue needs immediate attention or if it can wait for later. If you are looking for more general guidance on how to give users feedback (task-triggered or system-triggered feedback), then please read our <PageLink path=\"/guidelines/system-feedback/\">system feedback guidelines</PageLink>. \n\n### Timing\nIt is always good to consider when the error message should be displayed. Showing an error message prematurely will lead to confusion and annoyance - and in the end, it can cause the user to make more errors and not be able to resolve the initial one. This is especially true in cases where inline validation triggers errors before the user is finished typing. \n\n<Example\n  imageSrc=\"./_images/timing-dont.svg\"\n  caption=\"Don't show error messages prematurly. It creates confusion and annoyance\"\n  indicator=\"error\"\n/>\n\n### Contrast\nContrast plays an important role in making sure that the error message can be read by users who have vision impairment. Ensuring that we meet the WCAG 2.2 - Level AA requirements for colour contrast is crucial to make sure that the error message is accessible. Read more about colour contrast in our <PageLink path=\"/guidelines/accessibility/checklist/#colour-contrast\">Accessibility checklist</PageLink>.\n\n## Writing error messages\n\nA number of additional aspects should be taken into account when writing error messages.\n\n### Tone-of-voice\n\n**Important note:** before writing any error messages, it is important to familiarize ourselves with the Maersk brand values and the tone of voice (TOV). \n\nRead more about the Maersk <PageLink path=\"/content/tone-of-voice/\">tone of voice</PageLink>.\n\n### Use a language that is relatable, kind, and easy to understand\nError messages are typically part of a negative journey, especially if they are triggered from user input that is incorrect. e.g., Wrong password. This can prevent or delay an action, causing frustration. Avoid being accusatory, derisive, or judgemental. The error text should be straightforward but kind - short and concise using legible and readable text. Avoid using technical or Maersk-specific jargon, but instead use the words that the user would expect in the context. Avoid the use of error codes and abbreviations. \n\n### Don't blame the user - be positive and helpful\n\n- Never blame the user. Error messages must be positive without neglecting the severity of the issue.  \n- Avoid using humour since that can easily be misunderstood and result in a negative effect. \n- Always make sure to adjust the tone of voice. It is a good idea to make the error message human, positive and polite. Keep your text simple and use kind words such as “Please”, “Sorry”, Kindly”, etc.  \n\n### Describe what happened\nMake sure that you precisely describe what the issue is and avoid generic error messages such as “an error has occurred” without specifying what error, since this will leave the user questioning what happened. Instead, provide a clear and concise description of what happened and suggest how to resolve the issue in the best possible way. \n\n### Describe how to resolve the issue\nA good error message both describes the issue but also gives clear, good advice on how to resolve the issue. In cases where the error message is more than a sentence, then consider highlighting the key information, so that it is easier to scan. If you add links to the error message, then make sure that they are as descriptive as possible. Read more about link best practices on our <PageLink path=\"/components/link/\">link component page</PageLink>.\n\n\n## Dos and don'ts \n\n<br />\n\n<div class=\"mds-table mds-table--scrollable mds-table--vertical-lines-solid\">\n  <table>\n    <thead>\n      <tr>\n        <th style=\"width: 50%; background: var(--mds_brand_appearance_success_weak_background-color);\"><Indicator indicatorType=\"success\" rounded=\"all\" /></th>\n        <th style=\"width: 50%; background: var( --mds_brand_appearance_error_weak_background-color);\"><Indicator indicatorType=\"error\" rounded=\"all\" /></th>\n      </tr>\n    </thead>\n    <tbody>\n      <tr>\n        <td>Please enter a valid postcode e.g. AA1 1AA.</td>\n        <td>Wrong post code.</td>\n      </tr>\n      <tr>\n        <td>Please enter a valid email address.</td>\n        <td>Enter a valid email address.</td>\n      </tr>\n      <tr>\n        <td>Sorry, the document couldn't be uploaded. Please try again.</td>\n        <td>Upload failed.</td>\n      </tr>\n      <tr>\n        <td>Unfortunately, the document is not available. Please refresh the page or try again later.</td>\n        <td>Document not available.</td>\n      </tr>\n      <tr>\n        <td>Sorry, invoices for the selected items are not available. Please check the ETA/ETD of the vessel or <a href=\"#\">contact customer service</a>.</td>\n        <td>Action not possible.</td>\n      </tr>\n      <tr>\n        <td>Unfortunately, we are experiencing some issues. Please refresh the page or try again later.</td>\n        <td>The system gives no response.</td>\n      </tr>\n      <tr>\n        <td>Sorry, you seem to not have access. Is this wrong? Please try again or <a href=\"#\">contact customer service</a>.</td>\n        <td>You don't have access.</td>\n      </tr>\n      <tr>\n        <td>Sorry, your log in session has expired. Please login again to continue.</td>\n        <td>Log in timeout.</td>\n      </tr>\n    </tbody>\n  </table>\n</div>\n\n<br />\n\nIf you have a restricted text space (e.g. error prompt in forms) try to convey the same tone but shortening to the minimum message.  \n\n**To summarise:**\n\n- Find where errors may occur and prevent them, when possible. \n- Consider when / where the error message should be displayed. \n- Be positive and helpful - avoid being accusatory, derisive, or judgemental. \n- Describe what caused the error. \n- Suggest how the user can resolve the issue.\n\n\nNeed help writing an error message? Raise your issue in our <a href=\"https://teams.microsoft.com/l/channel/19%3A326a1c086d77416fa34afb3577bec741%40thread.skype/UX%20Writing%20-%20Copywriting?groupId=f5d54b22-e886-4278-98df-d9aadca2040a&tenantId=05d75c05-fa1a-42e7-9cf1-eb416c396f2d\" target=\"_blank\" rel=\"external noopener noreferrer\">UX Writing hotline chat</a>. "
}