{
  "timestamp": 1752222500378,
  "data": "---\ntitle: Currency and pricing\nnavTitle: Currency and pricing\ndescription: \"Displaying currency and prices across Maersk digital products.\"\ncontributors:\n  - janessa-walger\ntags:\n  - money\n  - charge\n  - discounts\n  - exchange\n  - price\n  - ISO code\n  - symbol\n  - currency\n  - denomination\n  - localisation\n  - amount\n  - invoice\n  - finance\n---\n\n\n## Displaying currencies\n\nThe following section explains what you need to consider when displaying currencies in digital products. \n\n### Use ISO currency codes\n\nThere are [180 globally recognized currencies](https://en.wikipedia.org/wiki/List_of_circulating_currencies), each with a standardized three-letter [ISO currency code](https://en.wikipedia.org/wiki/ISO_4217#Active_codes_(list_one)) e.g. USD, AUD, HKD. The ISO currency codes are commonly used in financial documents and reports e.g. the USD code is used in [Maersk’s Financial Reports](https://investor.maersk.com/financials/financial-reports).\n\nThe Maersk Design System recommends using [ISO currency codes](https://en.wikipedia.org/wiki/ISO_4217#List_of_ISO_4217_currency_codes) in digital products to ensure clarity and eliminate ambiguity.\n\n<Example \n  imageSrc=\"./_images/anatomy.png\"\n  imageMaxWidth=\"391px\"\n  caption=\"Anatomy of displayed price with ISO currency code.\"\n/>\n  \n<Notification>\nAs a general rule, Maersk provides shipping prices in the USD currency code and displays local charges in local currency codes. \n</Notification>\n<br />\n\n#### Add space between the ISO code and the amount\n\nFor readability make sure to add space between the currency code and the amount. \n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/iso-1.png\"\n    imageMaxWidth=\"252px\"\n    indicator=\"success\"\n    caption=\"Always add space between the currency code and amount.\"\n  />\n  <Example \n    imageSrc=\"./_images/iso-2.png\"\n    imageMaxWidth=\"252px\"\n    indicator=\"error\"\n    caption=\"Currency code should not be written as part of the amount.\"\n  />\n</Grid2Cols>\n\n#### Avoid using currency symbols\n\nNot all currencies have currency symbols (e.g., [Switzerland's CHF](https://en.wikipedia.org/wiki/Swiss_franc)), and multiple currencies share the same symbol, which can confuse some users. For instance, more than 15 currencies use the \"$\"\" symbol.\n\nTo avoid ambiguity, the Maersk Design System recommends avoiding currency symbols altogether in digital products.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/avoid-currency-symbols-1.png\"\n    imageMaxWidth=\"252px\"\n    indicator=\"success\"\n    caption=\"Use ISO currency code to eliminate ambiguity.\"\n  />\n  <Example \n    imageSrc=\"./_images/avoid-currency-symbols-2.png\"\n    imageMaxWidth=\"252px\"\n    indicator=\"error\"\n    caption=\"Currency symbols can be used for multiple different currencies.\"\n  />\n</Grid2Cols>\n\n### ISO code placement\n\nThe ISO currency code can be placed before or after the amount. Where to place the currency code varies depending on the context and location. \n\n#### ISO code before the amount\n\nIt is an internationally accepted standard that the ISO code is placed before the amount e.g., USD 100.00, EUR 50, so for most locations and contexts, that should be the go-to practice. \n\n<Example \n  imageSrc=\"./_images/placement-2.png\"\n  imageMaxWidth=\"307px\"\n  caption=\"Place currency code before the amount when pricing services.\"\n/>\n\n#### ISO code after the amount\n\nPlacing the ISO currency code after the amount can be appropriate in some contexts, particularly in non-English speaking regions and when there are different linguistic norms. For example, you might see “100 EUR” in Germany and France.\n\n<Example \n  caption=\"Currency code after the amount allows for a more natural reading experience especially when in the context of long text not in financial documents.\">\n  <Notification appearance=\"warning\" heading=\"Attention\">\n    Delays in pickup time caused by the supplier will add additional charges of <strong>15,00 EUR</strong> per hour.\n  </Notification>\n</Example>\n\n\n#### Consistency\n\nWhether you place the currency code before or after the amount, make sure you do it consistently across the product to avoid confusion and increased cognitive load for the user. If, for example, a product’s price needs to be shown in several currencies for different regions, display the currency code in front of the amount and format the amount based on the localisation.\n\n<Example \n  imageSrc=\"./_images/placement-3.png\"\n  imageMaxWidth=\"368px\"\n  caption=\"Keep the placement and number formatting consistent for prices in the same context even they might require different formatting.\"\n/>\n\n\n### Currency Conversion\n\nCurrency conversation is the process of converting one currency into another to determine the equivalent value. It is recommended to use real-time exchange rate APIs to dynamically update prices to make sure they reflect the current market conditions. \n\n<Example \n  imageSrc=\"./_images/currency-conversion-1.png\"\n  imageMaxWidth=\"368px\"\n  caption=\"It is important to keeping the currency conversion information transparent for the viewer.\"\n/>\n\n#### Currency conversion recommendations\n\nFollow these recommendations, if you need to display currency exchange in your product:\n\n- Do not handle any conversion in the Front End. \n- Use real-time exchange rates and provide the source and time of the update.\n- Inform users when rates were last updated to maintain transparency.\n- Clearly state any conversion fees applicable when switching between currencies.\n- Include fallback mechanisms like using the last known rate or a default rate if the exchange rate API fails.\n- Notify users of any issues with conversion or pricing updates to build trust.\n- Consider showing prices in both local and international currencies (e.g., USD) to help users better understand costs. \n\n\n## Displaying prices\n\nThe following section explains what you need to consider when displaying prices in digital products.\n\n### Price formatting\n\nClear and context-appropriate price formatting enhances user understanding and trust. \n\n<Example \n  imageSrc=\"./_images/anatomy2.png\"\n  imageMaxWidth=\"391px\"\n  caption=\"Anatomy of displayed price with price amount and localised formatting.\"\n/>\n\n#### Decimals\n\nAlways display full decimal values when exact amounts are required e.g. prices in invoices. This ensures users have full transparency and clear expectations of the final price. The format of the decimal separator can vary depending on location. Please read more about applying international standards under our <PageLink path=\"/content/numbers/localisation\">Number Localisation Guidelines</PageLink>.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/decimals-1.png\"\n    imageMaxWidth=\"252px\"\n    caption=\"Example decimal formatting in US, UK and China.\"\n  />\n  <Example \n    imageSrc=\"./_images/decimals-2.png\"\n    imageMaxWidth=\"252px\"\n    caption=\"Example decimal formatting in most of Europe.\"\n  />\n</Grid2Cols>\n\n<Notification>\nFor external reporting, use US/UK formatting (period as a decimal separator), even for currencies like EUR.\n</Notification>\n\n<br />\n\n#### Hiding decimals values\n\nHiding the decimal values can sometimes be appropriate e.g. in a promotional context or for currencies with low denomination values like the Japanese yen, where decimals are rarely used. This approach can simplify the presentation and improve readability.\n\n<Example \n  imageSrc=\"./_images/decimals-3.png\"\n  imageMaxWidth=\"368px\"\n  caption=\"Low denomination values might round the decimals even in official documents such as Invoices.\"\n/>\n\n<Example \n  imageSrc=\"./_images/decimals-4.png\"\n  imageMaxWidth=\"307px\"\n  caption=\"Pricing without decimals is easier to read and understand especially in promotional context.\"\n/>\n\n#### High Denomination Amounts\n\nHigh-denomination prices can be challenging to display due to their length and the cognitive load they impose. Use abbreviations where appropriate e.g., “k” for thousands, “m” for millions and “bn” for billions. For example, USD 2,100,000,000 can be displayed as USD 2.1bn without spacing between the decimal and abbreviation.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/high-1.png\"\n    imageMaxWidth=\"252px\"\n    caption=\"High denomination amounts take up screen space and can be challenging to read.\"\n  />\n  <Example \n    imageSrc=\"./_images/high-2.png\"\n    imageMaxWidth=\"252px\"\n    caption=\"Abbreviations can make larger sums easier to read and reduce the cognitive load.\"\n  />\n</Grid2Cols>\n\n### Price styling\n\nStyling can significantly affect how prices are displayed and understood. The following styling best practices will help design effective pricing: \n\n- Prioritise the most critical pricing information (e.g., total cost) by making it more prominent.\n- Use font weight (bold), size and colour to emphasise important details.\n- Group related pricing elements together to provide context for the viewer. (e.g., base price, additional charges and taxes)\n- Support comparison of prices with close placement and consistent formatting.\n- When showing discounts, the new and old prices should be clearly stated and accessible.\n\n### Price range\n\nDisplaying pricing ranges accurately is crucial for transparency and user trust. This section outlines best practices for presenting price ranges and considerations to keep in mind.\n\n<Grid2Cols>\n  <Example \n    imageSrc=\"./_images/range-1.png\"\n    imageMaxWidth=\"307px\"\n    contentHeight=\"274px\"\n    caption=\"Price range with max and min values.\"\n  />\n  <Example \n    imageSrc=\"./_images/range-2.png\"\n    imageMaxWidth=\"307px\"\n    contentHeight=\"274px\"\n    caption=\"Dynamic price range with min and no estimated max value.\"\n  />\n</Grid2Cols>\n\n- Ensure the pricing range is easy to read and understand.\n- Provide contextual information influencing the price range (e.g., weight, distance, delivery speed).\n- If prices fluctuate based on real-time data (e.g., fuel costs, demand), ensure the pricing range updates dynamically.\n- Use a tooltip or notification to explain why prices might vary.\n- Include disclaimers if necessary to clarify any legal considerations.\n\n### Price comparison\n\nA good price comparison is easy to understand and helps the user make informed decisions. To ensure an effective price comparison use the following guidelines:\n\n- Ensure all prices are formatted and styled consistently.\n- Indicate if the time factor, such as monthly or yearly pricing, impacts pricing.\n- Highlight the best value for a price if it makes sense for the context.\n- Place all prices that need to be compared close.\n- In data tables, it is best to right-align and use a monospaced font to help compare the amounts.\n\n<Example \n  imageSrc=\"./_images/comparison-1.png\"\n  caption=\"Consistent price formatting and placement are crucial to support the price comparison process.\"\n/>\n\n<Notification appearance=\"warning\">\n Use tooltips to provide additional context when users interact with pricing elements.\n</Notification>\n\n### Accessibility\n\nEnsure pricing information is presented in a readable format for all users, including those with visual impairments. Additionally, make sure that the screen reader can access all the information and that it reads it in the intended way. \n\n#### Use ARIA-labels\n\nUse clear and concise ARIA labels like “Original price” and “Discount price” to provide additional context for screen readers.\n\n```html\n<p>\n  <del aria-label=\"Original price: USD 19.99\">USD 19.99</del>\n  <ins aria-label=\"Discount price: USD 9.99\">USD 9.99</ins>\n</p>\n```\n\nFor example, when using strikethrough text to style the old price, ensure accessibility by including a proper ARIA label. This way we make sure that screen readers can read it.\n\n<Example \n  imageSrc=\"./_images/discounts-1.png\"\n  imageMaxWidth=\"353px\"\n  caption=\"Apply styles and formatting based on the context of the product and user’s expectations.\"\n/>\n\n\n### Localisation\n\n- Adapt the currency format based on the user’s language and region settings. This includes adjusting the currency code’s placement and the numbers’ format. Please check our <PageLink path=\"/content/numbers/localisation\">Number Localisation Guidelines</PageLink>.\n- Use geolocation to automatically detect and display prices in the user’s local currency, with an option to change if needed.\n- Whenever possible, allow users to choose their preferred currency format in their profile settings. This can enhance user experience by catering to individual preferences.\n\n<Notification>\nIt is a good idea to seek guidance from the [Maersk Competition Law & Policy team](https://teamsite.maerskgroup.com/sites/cf-gle/SitePages/Competition%20Compliance.aspx) in cases where the product is used set or change prices and surcharges. \n</Notification>"
}