{
  "timestamp": 1752222454540,
  "data": "---\ntitle: Corner radius\ndescription: \"Corner radius refers to the curvature of the corners on elements like cards, buttons, notifications etc.\"\ntags:\n  - border\n---\n\nOur visual design language is defined and built around the Maersk symbol, more specifically it is the language of the round corners of the container. Making the curvature of borders an important part of our design language, contributing to the overall brand recognition and ensuring a consistent look and feel across all our components.\n\n## Nested components\n\nFor components that contain other components, it is important to ensure that the outer component has a larger corner radius than the nested component. This approach creates a visually appealing and balanced spacing between the two elements.\n\nAll components come with a default border radius applied and are designed to work harmoniously in most situations. However, there may be special cases where you need to manually adjust the border radius of a nested component. In the table below, you can view all the available values.\n\n## Values\n\n| Name | Value |\n|------|-------|\n| radius-xs | 2px |\n| radius-sm | 4px |\n| radius-md | 6px |\n| radius-lg | 8px |\n| radius-xl | 12px |\n| radius-2xl | 16px |\n| radius-full | 9999px |\n\n## 2xl radius (16px)\n\nUsed for elements such as large images, dialogs, or modals.\n\n<Example\n  imageSrc=\"./_images/2xl.png\"\n  caption=\" 2xl radius example.\"\n  imageMaxWidth=\"644px\"\n  paddingCssClasses=\"px-6 py-20\"\n/>\n\n## xl radius (12px)\n\nUsed for components such as cards, which frequently contain nested components.\n\n<Example\n  imageSrc=\"./_images/xl.svg\"\n  caption=\"xl radius example.\"\n  paddingCssClasses=\"px-6 py-16\"\n/>\n\n## lg radius (8px)\n\nUsed for components such as notifications, toasts, popovers, and tables.\n\n<Example\n  imageSrc=\"./_images/lg.svg\"\n  caption=\"lg radius example.\"\n  paddingCssClasses=\"px-6 py-28\"\n/>\n\n## md radius (6px)\n\nElements such as buttons and input fields.\n\n<Example\n  imageSrc=\"./_images/md.svg\"\n  caption=\"md radius example.\"\n  paddingCssClasses=\"px-6 pt-16 pb-28\"\n/>\n\n## sm radius (4px)\n\nSmaller components, such as checkboxes.\n\n<Example\n  imageSrc=\"./_images/sm.svg\"\n  caption=\"sm radius example.\"\n  paddingCssClasses=\"px-6 py-24\"\n/>\n\n## xs radius (2px)\n\nSmall components that are typically nested inside other components.\n\n<Example\n  imageSrc=\"./_images/xs.svg\"\n  caption=\"xs radius example.\"\n  paddingCssClasses=\"px-6 pt-18 pb-12\"\n/>"
}