{
  "timestamp": 1752222465926,
  "data": "---\ntitle: Applying type\ndescription: Create text content that is readable and easily localised.\ntags:\n  - typography\n  - hierarchy\n  - headline\n  - body\n  - text\n  - all caps\n  - truncation\n  - alignment\n  - line\n  - length\n  - localisation\n---\n\nFollow the recommendations below to increase typographic consistency and coherence across Maersk digital products. \n\n## Hierarchy\n\nThe available typeface scale provides nine levels of hierarchy (five headlines and four text sizes). There is no need to use all hierarchy levels if a project does not require them. Each level should have a purpose communicated through the different font styles. \n\n### Headlines and sub-headlines\n\nHeadlines communicate vital short messages or numerals. These styles are more prominent in the interface and naturally draw the user's eye to them. Users should instantly grasp the purpose of the section and layout region to which the headline and sub-headlines belong.\n\n<Example \n  paddingCssClasses=\"p-0\" \n  caption=\"Use headlines to communicate the purpose of sections and regions.\"\n  imageSrc=\"./_images/hierarchy.svg\"\n/>\n\n### Body text\n\nBody text communicates short and long text messages. It can be grouped with headlines or displayed as part of another component that transmits the general purpose of the body text. \n\n<Example \n  paddingCssClasses=\"p-0\" \n  caption=\"When the purpose of the body text is clear, there is no need for a headline. \"\n  imageSrc=\"./_images/body-text.svg\"\n/>\n\n## Space\n\nSpace creates a relationship between text and the content it belongs to. As a general rule, text (e.g., a headline) should be spaced closer to the content it belongs to and have more space for content that belongs to other sections/regions. Read more about consistent <PageLink path=\"/design-language/spacing/\">spacing</PageLink> and how it creates rhythm. \n\nHeadlines that represent the page or application title should use enough space around them to disconnect them from a specific content region and designate them as the main title in the page hierarchy. \n\n<Example \n  paddingCssClasses=\"p-0\" \n  imageSrc=\"./_images/space.svg\"\n  darkWarning={false}\n/>\n\n## Truncation\n\nTruncation is a technique that involves displaying only a portion of text or content, often due to space or layout constraints. It helps to prevent visual clutter and cognitive overload but brings the risks of hindering comprehension of the text message. \n\nUse truncation sparingly only when it is necessary. Ensure that the truncated message remains meaningful and communicates clearly.. Read more in our <PageLink path=\"/content/truncation/\">truncation guidelines</PageLink>.\n\n<Grid2Cols>\n  <Example \n    paddingCssClasses=\"p-0\" \n    caption=\"Truncated content should still be disclosable and readable.\" \n    imageSrc=\"./_images/truncation-1.svg\"\n    darkWarning={false}\n  />\n  <Example \n    paddingCssClasses=\"p-0\" \n    caption=\"Without truncation layouts and compositions can be impacted.\"\n    imageSrc=\"./_images/truncation-2.svg\"\n    darkWarning={false}\n  />\n</Grid2Cols>\n\n## Readability\n\nFollow the guidelines below to help readers absorb information from the text and achieve optimal readability and scalability in responsive layouts.\n\n### Left-alignment\n\nWhen working with large blocks of text, use left-aligned text. It makes information more accessible to read and understand for left-to-right languages.\n\n<Notification>\nMaersk typography does not support right-to-left languages, like Arabic or Hebrew. \n</Notification>\n\n<Example \n  paddingCssClasses=\"p-0\"\n  imageSrc=\"./_images/left-alignment.svg\"\n  darkWarning={false}\n/>\n\n### Right-alignment\n\nUse right-aligned text for numeric values (including dates, times, and currency). This eases comparisons within a data set within a table column. Numeric values that are not comparable should be left-aligned to match the rest of the content.\n\n<Example \n  paddingCssClasses=\"p-0\"\n  imageSrc=\"./_images/right-alignment.svg\"\n  darkWarning={false}\n/>\n\n### Center-alignment\n\nCentre-aligning should be used only for short sentences or blocks of text such as a pull quote, headlines with pictograms and key metrics. Avoid centre-aligning large blocks of text since that leads to additional eye movement on both sides of the text and can hinder reading accuracy. \n\n<Example \n  paddingCssClasses=\"p-0\"\n  imageSrc=\"./_images/center-alignment.svg\"\n  darkWarning={false}\n/>\n\n### Justified text\n\nAvoid using justified text. It can lead to unnecessary negative space and gaps between words. Use it only if content needs to align with print materials.\n\n<Grid2Cols>\n  <Example \n    paddingCssClasses=\"p-0\" \n    indicator=\"success\" \n    caption=\"Left-align text to increase readability.\" \n    imageSrc=\"./_images/justified-text-1.svg\"\n    darkWarning={false}\n  />\n  <Example \n    paddingCssClasses=\"p-0\" \n    indicator=\"warning\" \n    caption=\"Avoid using justified text unless matching print materials.\"\n    imageSrc=\"./_images/justified-text-2.svg\"\n    darkWarning={false}\n  />\n</Grid2Cols>\n\n### Line-height\n\nThe <PageLink path=\"/design-language/themes/maersk/\">typography tokens</PageLink> come out of the box with optimised line height for each font size. In Figma, the bounding box of text styles represents the line height. When spacing elements around text, use the bounding box to specify the space between text and surrounding elements. \n\n<Example \n  paddingCssClasses=\"p-0\" \n  caption=\"The text bounding box in Figma represents the line height, avoid manually overwriting the height of it.\"\n  imageSrc=\"./_images/line-height.svg\"\n  darkWarning={false}\n/>\n\n### Line length\n\nAim for a line length of 60 to 80 characters, including spaces, which provides an optimal reading experience. Broad lines of text can be challenging to read and may hinder focus. Too narrow lines disrupt the reader's rhythm, leading to skipping essential words. Avoid exceeding 100 characters per line in any block of text.\n\n<Example \n  paddingCssClasses=\"p-0\"\n  imageSrc=\"./_images/line-length.svg\"\n/>\n\n### Responsive line length\n\nReaders might control the layout width by resizing the browser window, so designing for an exact line length can be a challenge. Based on the font size, aim to set the maximum width of a text container to accommodate line lengths up to 100 characters (including spaces). When the content container reaches the maximum width, it will continue to expand with even margins on either side, and the text will stay readable.\n\n<Example \n  paddingCssClasses=\"p-0\"\n  imageSrc=\"./_images/responsive-line-length.svg\"\n  darkWarning={false}\n/>\n\n\n## Type for localisation\n\nWhen translating a product, it is good to write for localisation. It also helps us shape inclusive text content that is easier for many cultures to understand. \n\nTranslated text can expand significantly, which can impact the interface layout and readability. For example, translating from English into German may expand text length by as much as 35%. Keeping headlines and labels as short as possible helps to avoid some of that impact. \n\n<Grid2Cols>\n  <Example \n    paddingCssClasses=\"p-0\" \n    caption=\"Assume translated text could expand by 35% or more.\"\n    imageSrc=\"./_images/type-for-localisation-1.svg\"\n    darkWarning={false}\n  />\n  <Example \n    paddingCssClasses=\"p-0\" \n    caption=\"Translated content could be truncated or impact the layout.\"\n    imageSrc=\"./_images/type-for-localisation-2.svg\"\n    darkWarning={false}\n  />\n</Grid2Cols>\n\nUse abbreviations only if they are industry standard and need not be localised or translated. Abbreviations make translation harder and can significantly impact the interface layout if one language uses abbreviations and the translated version uses the whole word. \n\n<Grid2Cols>\n  <Example \n    paddingCssClasses=\"p-0\" \n    indicator=\"success\" \n    caption=\"Use concise text that can be localised.\" \n    imageSrc=\"./_images/type-for-localisation-3.svg\"\n    darkWarning={false}\n  />\n  <Example \n    paddingCssClasses=\"p-0\" \n    indicator=\"warning\" \n    caption=\"Avoid using abbreviations unless all users expect them. \" \n    imageSrc=\"./_images/type-for-localisation-4.svg\"\n    darkWarning={false}\n  />\n</Grid2Cols>\n\nLocalisation goes beyond translating text from one language to another while maintaining the same meaning. It adapts content, visuals and user experience to suit a specific market or culture. Please check also the <PageLink path=\"/content/numbers/localisation/\">Number localisation guideline</PageLink>.\n\n## Accessibility\n\nAll text within the Maersk design system meets the Web Content Accessibility Guidelines (WCAG) 2.0 level AA requirements to ensure legibility. We strongly recommend maintaining the predefined <PageLink path=\"/design-language/themes/maersk/\">typography</PageLink> and <PageLink path=\"/design-language/themes/maersk/light/\">colour</PageLink> tokens. \n\nAlways ensure sufficient contrast if you need to use custom colours for text content and its background. Contrast depends on the size and colour of the text against its background colour and the level of accessibility required for the product. The [Colour Contrast Analyzer (CCA)](https://www.tpgi.com/color-contrast-checker/) can check if the contrast meets WCAG 2.1 requirements. "
}