{
  "timestamp": 1752222454231,
  "data": "---\ntitle: Component fit (size)\ndescription: \"Choose between small, medium and large components.\"\ntags:\n  - core\n  - sizes\n  - small\n  - medium\n  - large\n---\n\nTo support different use cases and applications, the Maersk Design System core components typically come in 3 different fit (sizes) - small, medium and large.\n\n<Grid3Cols>\n  <Example\n    imageSrc=\"./_images/small.svg\"\n    caption=\"Small fit\"\n  />\n  <Example\n    imageSrc=\"./_images/medium.svg\"\n    caption=\"Medium fit\"\n  />\n  <Example\n    imageSrc=\"./_images/large.svg\"\n    caption=\"Large fit\"\n  />\n</Grid3Cols>\n\n## How to use\n\nIn code, the property “fit” is used to change the size of the components and in Figma there is also a “fit” option.\n\n<Grid2Cols>\n  <Example \n    caption=\"Fit in our developer docs.\" \n    imageSrc=\"./_images/storybook.png\"\n    darkWarning={false}\n  />\n  <Example \n    caption=\"Fit in our Figma library.\" \n    imageSrc=\"./_images/figma.png\"\n    darkWarning={false}\n  />\n</Grid2Cols>\n\n## When to use\n\nThe following is a high-level direction on how to use the small, medium and large components:\n\n**Small** components allow for more dense layouts which is often needed in very data and information heavy applications. Small fit is also a good choice, if the end-users are working on smaller desktop screens and you need to provide them with a very compact layout or view.\n\n**Medium** is the default component size that is used on Maersk.com and it is often the right choice, if you are building customer facing websites that are not too data heavy.\n\n**Large** components support more relaxed and spacious layouts that works well on more visual and brand related pages e.g. marketing landing pages. Also use large fit for touch devices where a bigger touch area is needed.\n\n## Keep it consistent\n\nIn most applications, it is a good idea to stick to one component fit (size). Mixing components with different fit can make the application hard to keep consistent and in the end hard to maintain.\n\nIf you are mixing components with different fit, then make sure that it has a very clear purpose and there are clear rules on when to use which.\n\n## Why is it called 'fit'?\n\nWhen naming the properties for our core components, we always look to provide consistent naming for both design and engineering.\n\nAt first, we chose the property name \"size\", but this clashed with the existing \"size\" property on the HTML input field. In this instance, \"size\" indicates how many characters wide the input field should be.\n\nWe also considered \"scale\" and \"density\". Both do not accurately reflect our solution. We do not simply scale a component to make different sizes. Similarly, we do more than adjust the internal spacing within a component (density).\n\nThe conclusion was to borrow an analogy from clothing. A shirt, for example, can be available in a \"tailored fit\" or \"loose fit\". In both, the size of each fit is different. However, certain parts are the same, for example, the size of the buttons used.\n"
}