{
  "timestamp": 1752222466146,
  "data": "---\ntitle: Typography\ndescription: Create clear and readable communication across digital products.\ntags:\n  - typefaces\n  - font family\n  - arial\n  - maersk\n  - text\n  - headline\n  - type\nchildPageOrder:\n  - typestyles\n  - applying-type\nrenderAllChildPagesAsTabs: true\n---\n\nTypography shapes how written messages resonate with viewers. It's more than arranging\nletters and how they look; it influences readability, layout and communication. It\nis the base of crafting a delightful reading journey.\n\n## Typefaces\n\nThe Maersk typeface encapsulates our company's values and characteristics. It plays an integral role in brand recognition and tone of voice. A visual tone of voice can saturate a brand on multiple platforms and ensure a strong brand identity—even when images and logos are out of sight.\n\n### Maersk Headline\n\nMaersk Headline font creates a clear hierarchy on application pages through titles and headlines. Its purpose is to communicate a short message that attracts the user's attention.\n\n<Example \n  paddingCssClasses=\"p-0\" \n  imageSrc=\"./_images/maersk-headline.svg\" \n/>\n\n### Maersk Text\n\nMaersk Text font is applicable for labels, captions, data table content, and long blocks of text, such as articles.\n\n<Example \n  paddingCssClasses=\"p-0\" \n  imageSrc=\"./_images/maersk-text.svg\" \n/>\n\n### Arial (Fallback)\n\nThe fallback font is Arial for the cases when the default Maersk font is unavailable. Arial is also the default choice for email communication, as email clients might not be able to load or render the Maersk fonts.\n\n<Example \n  paddingCssClasses=\"p-0\" \n  imageSrc=\"./_images/arial.svg\" \n/>\n\n## Type scale\n\nMaersk Design System offers two groups of type scales: headline and text. Both groups are available for desktop and mobile use. Each group has multiple font styles to accommodate a range of different purposes. By default, all headline styles use Maersk headline, and all text styles use Maersk text. View our <PageLink path=\"/design-language/themes/maersk/\">typography tokens</PageLink>.\n\n<Example \n  paddingCssClasses=\"p-0\" \n  imageSrc=\"./_images/type-scale.svg\" \n/>\n\n## Best practices\n\n- Use the <PageLink path=\"/design-language/themes/maersk/light/\">colour tokens</PageLink> for text to provide accessible text\n- Do not mix more than two colours in a headline or body text.\n- Use only the predefined font styles and sizes with their line heights.\n- Use headings according to their importance and information hierarchy, not for their visual appearance.\n- Use sentence case capitalisation (except for product names). Do not use ALL CAPS!\n- Do not mix weights and font sizes in the same headline.\n- Use monospaced tabular numbers only for specific use cases of data comparison.\n"
}