{
  "timestamp": 1752222486489,
  "data": "---\ntags:\n  - data\ntitle: Data visualisation process\nnavTitle: Process\ndescription: A data visualisation process based on a common Design Thinking process.\ncontributors:\n  - priyamohapatra\n  - thomasbove\n---\n\n<AlphaWarning />\n\nTo get you on the way and to ensure that you create well thought through data visualisations, we have created the following data visualisation process based on a common Design Thinking process:\n\n<Example \n  imageSrc=\"./_images/process.png\" \n  darkWarning={false} \n/>\n\n## Starting point and iterations\n\nThe data and information you have about your target audience will help determine where in this process to begin.\n\nFor example, if you have a well-defined target audience, then you exactly know in which context/situation your data is valuable. In this situation, you might start with the ideation of different solutions <a href=\"#step-4-ideate\">(step 4)</a> and then build a concrete prototype <a href=\"#step-5-prototype\">(step 5)</a>.\n\nIt is important to note that data visualisation is an iterative process. You often will go back to previous steps based on new insights. For example, going from testing <a href=\"#step-6-test\">(step 6)</a> to a new prototype <a href=\"#step-5-prototype\">(step 5)</a>, or you might even go back and gather more information about your target audience <a href=\"#step-2-empathise\">(step 2)</a>.\n\n## Step 1: Initial brief\n\nAt the start, the initiative owner should share an initial brief with the rest of the team. This way, everyone involved understands the background of the initiative and the overall goal. The brief should capture the following details:\n\n<OptimizedImage src=\"./_images/stock-1.jpg\" ariaHidden={true} class=\"rounded float-right w-1/2 mt-0 mx-8 mb-2\" darkWarning={false} />\n\n- Description of the initiative\n- Goal of the initiative\n- Users and Stakeholders\n- Value for the business and for the end users\n- Available data (If any)\n- Expected timeline\n\nA good brief provides everyone with a clear scope and direction for the next steps.\n\n## Step 2: Empathise\n\nIn the second step, the focus is on gathering insights about your target audience and the context in which they operate.\n\nFamiliarising yourself with the data that is available is also a part of this step.\n\n### Understand your audience and context\n\n- Who is your target audience? (be specific)\n- What type of information do they need, where will it be used?\n- What will your audience do with the insights derived from the data visualisation?\n\n### Familiarise yourself with datasets and metrics\n\nThe data is the supporting evidence for the story you will be telling.\n\nYour starting point may be a dataset or some standard metrics. Datasets are the set of numbers or calculations gathered. Metrics set the parameters of the dataset that your organisation will use to measure performance.\n\n<OptimizedImage src=\"./_images/stock-2.jpg\" ariaHidden={true} class=\"rounded float-right w-1/2 mt-0 mx-8 mb-2\" darkWarning={false} />\n\nIf your starting point is a dataset, dive into it to narrow down the focus of your charts and develop metrics that represent what you want to show. If your starting point is metrics, acquire a basic understanding of what business purpose they serve. Doing this will help to design a cohesive story for your audience.\n\nThe metrics you choose for your visualisation should be few and thoughtfully conceived because they will powerfully influence what your audience will learn from the story. The best metrics have a clear link to actions and are easily understood by your audience.\n\n## Step 3: Define\n\nIn step 3, you articulate your problem or opportunity based on the insights from steps 1 and 2 and define a clear objective to work towards.\n\nThere are two sub-phases in this step.\n\n**1. Redefine the initial brief** (refer to <a href=\"#step-1-initial-brief\">Step 1</a>)<br />\nThe initial brief should be updated based on the user need, key insights discovered and availability of desired datasets for metrics.\n\n**2. Build your story**<br />\nStart developing a basic story around the data and the insights collected.\nThe data story structure should help you to define:\nWhat do you want to tell the audience and when?\nWhat can your audience do with these insights?\nOne way of building a compelling story is to use the traditional three-act story structure, where the story consists of three core elements - the context, the core insight and the action.\n\n## Step 4: Ideate\n\nWhen you have defined the problems, the opportunities and the data story, you can move on to the ideation phase to explore solutions. During this phase, prioritise quantity over quality to get a diverse range of ideas to prototype and test.\n\nThe ideation stage flows between idea generation and evaluation, but each process must remain separate from the other.\n\nKey steps for ideation on data visualisation are:\n\n- Stay focused on one topic\n- Sketch possible charts to support your data story (consider alternative <PageLink path=\"/guidelines/data-visualisation/chart-types/\">chart types</PageLink>)\n- Dive into your dataset by sketching rough drafts on paper\n- Go for quantity\n- Share drafts with colleagues early and often\n- Gather as much feedback as you can\n- Select the best chart solution\n\n## Step 5: Prototype\n\n<OptimizedImage src=\"./_images/stock-3.jpg\" ariaHidden={true} class=\"rounded float-right w-1/2 mt-0 mr-0 mb-8 ml-8\" darkWarning={false} />\n\nTake the best chart solution from the previous step and create a \"rough\" but realistic graphical representation to test with your target audience.\n\nWhen creating a prototype, you will get a good idea of what works and what doesn't in terms of data story structure and meaning. Based on the prototype, you might need to do some tweaks to your story, so that it is easy to understand and can drive the right decisions.\n\nIt is a good idea to start with a very rough (low fidelity) representation of what you want to create and improve this over time based on the feedback you get from your audience.\n\n## Step 6: Test\n\nIn step 6, you test your prototype with people from the target audience - preferably in a real scenario context. Doing this provides an in-depth understanding of what works well and what aspects of the prototype needs further refinement before your data visualisation works as intended.\n\nBe aware that what you suggest might turn out not to be the best solution, so be open and curious when you test. The end-user will give you direct or indirect insights if your solution solves the problem.\n\n## Step 7: Reflect & refine\n\nNow it is time to validate the solutions and select the one that resonates most with your target audience and solves the identified problem.\n\nAs mentioned in the beginning, this is not a linear process. There could be cases where we learn something new about our end users or more about the underlying problems that can send us back to the beginning.\n\n## Next steps\n\nOnce the solution is refined to account for user feedback, the prototype then goes for implementation and is released to its customers. However, the design thinking process doesn't end here. The released solution may need ongoing enhancements such as usability improvements. You may, for example, monitor the usage of the dashboard to find out how often it is being used and shared. It gives insight into how much impact you have had with it.\n"
}