{
  "timestamp": 1752222483928,
  "data": "---\ntags:\n  - data\ntitle: Clustered bar chart\nnavTitle: Clustered bar chart\ndescription: >-\n  A clustered bar chart extends the bar chart by displaying multiple values for each category. The values are shown as coloured bars which can be distinguished and compared across categories.\ncontributors:\n  - thomasbove\n---\n\n<AlphaWarning />\n\nUse a clustered bar chart when you want to show how a second variable changes within a category and allow the user to compare across categories. If it is important for the user to compare totals a Stacked bar chart may be more appropriate.\n\nA clustered bar chart can be displayed with vertical bars (primary categories on the horizontal axis) or horizontal bars (primary categories on the vertical axis):\n\n## Vertical\n\nVertical bar charts are useful when you're graphing ordinal variables (i.e. when subcategories have a natural sequence). They are useful for comparing different categorical or discrete variables if there are few categories and if their names are short.\n\n#### Example\n\n<Example \n  imageSrc=\"./_images/vertical.png\"\n  darkWarning={false}\n  caption=\"A user who wants to compare the number of shipments booked for 4 regions (origins) in every quarter of a year to take appropriate action on contracts.\"\n/>\n\n## Horizontal\n\nHorizontal bar charts are especially useful if you have many categories or if the category names are long because there is plenty of space for the labels when they are displayed below (rather than beside) each other.\n\n##### Example\n\n<Example \n  imageSrc=\"./_images/horizontal.png\"\n  darkWarning={false}\n  caption=\"A user who wants to compare the number of shipments booked for 4 regions (origins) in every quarter of a year to take appropriate action on contracts.\"\n/>\n\n## Best practice\n\n### Decide on the primary and secondary variables\n\nYou need to decide which of the two variables will be the primary (dictating the axis locations for each bar cluster) and which will be the secondary (dictating the number of bars to plot in each cluster). The most important one is usually the primary.\n\n### Decide on the order of category levels\n\nFor the primary variable, the principle of ordering bars from largest to smallest applies unless they have an inherent order. For the secondary variable, it is usually recommended to have a consistent order of bars across groups rather than ordering the bars from largest to smallest within each group.\n\n### Choose colours effectively\n\nColours are an integral part of the grouped bar chart in order to distinguish levels of the secondary categorical variable. See the <PageLink path=\"/guidelines/data-visualisation/chart-style-guide/\">Chart style guide</PageLink> and <PageLink path=\"/guidelines/data-visualisation/colour-best-practice/\">Colour best practice</PageLink> pages for additional guidance on appropriate colour choices within the Maersk colour palette.\n\n### Maintain a zero line\n\nShow the zero-baseline to avoid distorting the data.\n\n### Value annotation\n\nAnnotations for bar lengths can be added to a clustered bar chart just as they can for the standard bar chart. Horizontal bars leave more space for large values.\n"
}