{
  "timestamp": 1752222485440,
  "data": "---\ntags:\n  - data\ntitle: Stacked area chart\nnavTitle: Stacked area chart\ndescription: >-\n  An area chart is distinguished from a line chart by the addition of shading between lines and a baseline.\ncontributors:\n  - thomasbove\n---\n\n<AlphaWarning />\n\nYou can use a stacked area chart when you want to track not only the total value but also want to understand the breakdown of that total by groups. Comparing the heights of each segment of the curve allows you to get a general idea of how the subgroups compare to each other in their contributions to the total. Generally, when the term 'area chart' is used, what is actually implied is the stacked area chart.\n\n<Example \n  imageSrc=\"./_images/stacked-area.png\"\n  darkWarning={false}\n  caption=\"A user who wants to see a comparison of the trend in the quarterly revenue of 5 different products over the period of a year.\"\n/>\n\n## Best practice\n\n### Compare just a few categories\nStacked area charts might be colourful and fun, but you should use them with caution because they can quickly become messy and hard to read. Don't use them if you need an exact comparison and don't stack together more than three to five categories as a rule of thumb.\n\n### Include a zero-baseline\nWhile a line chart is not restricted to requiring a zero-baseline, the addition of shading means that the heights of the coloured regions will be used to compare the size of each group's values. Thus it is advised to show the zero-baseline.\n\n### Consider the order of categories\nA good rule of thumb is to put the largest or most stable categories at the bottom and the smallest or most volatile categories at the top.\n\n### Group tiny values\nIf it is meaningful for the story of the data, consider combining more tiny values into a bigger umbrella category to prevent clutter.\n\n### Add annotations and explanations\nAdd clarifying information to your graphs to make them easier for the users to interpret."
}