{
  "timestamp": 1752222483673,
  "data": "---\ntags:\n  - data\ntitle: Bullet chart\nnavTitle: Bullet chart\ndescription: >-\n  Bullet charts can be used to visualise multiple values relative to thresholds and target values.\ncontributors:\n  - thomasbove\n---\n\n<AlphaWarning />\n\nBullet charts enhance each bar with additional markings to show that bar's value in relation to thresholds and target values. This is usually in the form of a perpendicular line showing the target value, but background shading can also be used to provide additional performance benchmarks.\n\nCompared to the other types of performance charts (i.e. Pie/donut chart, Meter chart), a bullet chart allows you to fit the visualised data into a compact space. In addition, you can visualise data by either percentages or integer values (whereas pie/donut charts can only show percentages).\n\n## Vertical\n\n<Example \n  imageSrc=\"./_images/vertical.png\"\n  darkWarning={false}\n  caption=\"A user who wants to see how many FFEs are booked compared to the allocated FFEs for each week and plan accordingly.\"\n/>\n\n## Horizontal\n\n<Example \n  imageSrc=\"./_images/horizontal.png\"\n  darkWarning={false}\n  caption=\"A user who wants to see how many FFEs are booked compared to the allocated FFEs for each quarter for the current year, so that they can make appropriate decisions for an allocation contract.\"\n/>\n\n## Horizontal (advanced)\n\n<Example \n  imageSrc=\"./_images/horizontal-advanced.png\"\n  darkWarning={false}\n  caption=\"A user who wants to see the 'delivery promise fulfilment' for the prior week where the target was 80%.\"\n/>\n\n## Best practice\n\n#### Use a sequential colour scheme to illustrate the thresholds\n\nWhen choosing colours for the qualitative scale (thresholds) use distinct intensities of a single hue from dark to light (darker colours for the unwanted states and lighter colours for the favourable states). See the Chart style guide and Colour best practice pages for additional guidance on appropriate colour choices within the Maersk colour palette.\n\n#### Use bar direction to show 'favourable' vs. 'unwanted'\n\nBullet bars may both represent metrics which are considered good when they are high (e.g. revenue) and others that are considered good when they are low (e.g. expenses). If background fills are used as the only means to show thresholds the user might overlook them. In that case, consider reversing the bar direction for metrics which are supposed to be low.\n"
}