{
  "timestamp": 1752222481505,
  "data": "---\ntags:\n  - accessibility\ntitle: Accessibility checklist\nnavTitle: Checklist\n---\n\nimport AccessibilityCheckList from \"./_components/AccessibilityCheckList.astro\";\nimport accessibilityCheckListItems from \"./_components/accessibility-check-list-items.ts\";\n\nThe following checklist is based on the work of The A11Y Project and uses the WCAG 2.2 standard as a cross-reference. For each topic, there is a testable success criterion taken from the WCAG 2.2 standard.\n\nThe checklist should be seen as the first step in making your product accessible.\nThe checklist will improve the accessibility of your product, but it will not guarantee a fully accessible experience and does not cover all the WCAG 2.2 Level A and Level AA success criteria. To become fully Level AA compliant, then please follow the <PageLink path=\"/guidelines/accessibility/guidelines/\">Accessibility Guidelines</PageLink>.\n\n## Global code\n\nGlobal code is code that affects the whole application, website or webapp.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.globalCodeItems} />\n\n## Keyboard navigation\n\nIt is essential that your interface and content can be operated and navigated using a keyboard.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.keyboardNavigationItems} />\n\n## Appearance\n\nThe how the UI looks like and how it is presented in different circumstances e.g., when changing the text size or specialized browsing modes.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.appearanceItems} />\n\n## Colour contrast\n\nHow distinguishable colours are when they are placed on top or next to each other.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.colourContrastItems} />\n\n## Headings\n\nHeadings help structure content into a logical typographic hierarchy that breaks up the content in meaningful way. A strict typographic hierarchy helps especially people that uses assistive technologies to understand the meaning of a page.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.headingsItems} />\n\n## Controls\n\nControls are interactive UI elements that allow users to navigate through the application or trigger actions.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.controlsItems} />\n\n## Lists\n\nA list is a set of related items that are grouped together.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.listsItems} />\n\n## Tables\n\nA tables is a structured set of data that are mostly arranged in rows and columns.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.tablesItems} />\n\n## Images\n\nImages are widely used to enhance the communication and to enrich the user experience.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.imagesItems} />\n\n## Forms\n\nForms allow users to enter information into the application or site for processing, storage and manipulation e.g., creating an account or placing an order.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.formsItems} />\n\n## Media\n\nMedia is pre-recorded or live audio or video content.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.mediaItems} />\n\n## Animation\n\nApplying motion to UI elements, controls or content. The animation can be activated by its own or triggered though a user interaction.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.animationItems} />\n\n## Mobile\n\nA few things that can make mobile experiences more accessible.\n\n<AccessibilityCheckList items={accessibilityCheckListItems.mobileItems} />\n\n## Next steps\n\nIf you have met all the success criteria in the Accessibility Checklist then your product has become much more accessible and you are well on your way to become Level AA compliant. To become fully Level AA compliant, then follow the <PageLink path=\"/guidelines/accessibility/guidelines/\">Accessibility Guidelines</PageLink>.\n"
}