{
  "timestamp": 1752222483139,
  "data": "---\ntags:\n  - data\ntitle: Bar chart\nnavTitle: Bar chart\ndescription: >-\n  Bar charts are best used to compare different categories and it is expected that users will look up and compare individual values between each bar.\ncontributors:\n  - thomasbove\n---\n\n<AlphaWarning />\n\n## Vertical\n\nVertical bar charts are useful when you're graphing ordinal variables (i.e. subcategories have a natural sequence). They are useful to compare different categorical or discrete variables as long as there are not too many categories to compare or their labels are long.\n\n<Example \n  imageSrc=\"./_images/vertical.png\"\n  darkWarning={false}\n  caption=\"A user who wants to compare the number of shipments booked in every month to take appropriate action.\"\n/>\n\n## Horizontal\n\nHorizontal bar charts are especially useful if you have many categories or if the category names are long because there is plenty of space for the labels when they are displayed below (rather than beside) each other.\n\n<Example \n  imageSrc=\"./_images/horizontal.png\"\n  darkWarning={false}\n  caption=\"A user who wants to compare the number of shipments booked by customers for the month to take appropriate action.\"\n/>\n\n## Best practice\n\n### Consider the amount of categories\n\nUse vertical bar charts for comparison if the number of categories is quite small.\n\n### Use colour wisely\n\nCertain visualisation tools will colour each bar differently by default, but this can distract the reader by implying additional meaning where none exists. Instead, colour should be applied with purpose (e.g. to highlight specific columns for storytelling).\n\n### Maintain a zero line\n\nInclude the zero baseline to represent the data accurately. Our eyes are sensitive to the area of bars on a chart. If those bars are cut off, the viewer might draw the wrong conclusions.\n\n### Order category levels consistently\n\nIt is conventional to sort the bars from longest to shortest or vice versa. While it is always possible to compare the bar lengths no matter the order, this can reduce the burden on the reader to make those comparisons themselves.\n\n### Don't make users tilt their heads\n\nTo improve readability try to write labels horizontally (not vertically), whenever possible.\n"
}