{
  "timestamp": 1752222482290,
  "data": "---\ntags:\n  - accessibility\ntitle: Tools for validation and testing\nnavTitle: Tools\n---\n\nTesting and validation of your product's accessibility is crucial for the success of your product and should be performed as an integral part of your work. This page will give you a set of accessibility tools that makes it easier to test and validate your product.\n\n## Accessibility checkers\n\n**aCe**<br />\naCe is a cool tool that lets you check whether or not your site is compliant with web accessibility standards and legislation. Go to the [aCe website](https://ace.accessibe.com/).\n\n**Siteimprove Accessibility Checker (Chrome extension)**<br />\nThe Siteimprove extension lets you check a webpage up against the WCAG 2.1 accessibility guidelines and their corresponding success criteria. It lists the accessibility issues found and gives you recommendations on how to fix them. You can select which level of WCAG 2.1 conformance you want to check your webpage up against - either Level A, AA or AAA. Go to the [Chrome Web Store](https://chrome.google.com/webstore/detail/siteimprove-accessibility/efcfolpjihicnikpmhnmphjhhpiclljc).\n\n## Colour contrast checkers\n\n**Able - Figma plugin**<br />\nAs a designer, you have access to the pre-installed Figma plugin Able, that lets you check the colour contrast of two UI elements/layers in Figma. Go to Plugins in the top menu bar and select “Able - Friction free accessibility”. Go to Figma and try it out.\n\n**Who can use**<br />\nThis is a great tool for testing colour contrast. The tool gives you detailed information - both in terms of WCAG compliance (Fail, A, AA or AAA), but you can also see how people with different eye impairments will perceive the colours. Please notice, that you have to type in the colour values in the box to the left. Go to the [Who can use website](https://whocanuse.com/).\n\n## Impairment simulation tool\n\n**Silktide (Chrome extension)**<br />\nChrome browser extension that lets you simulate different types of disabilities. An eye-opener and a very good way to understand the challenges that users with impairments face when interacting with your website. Go to the [Chrome Web Store](https://chrome.google.com/webstore/detail/silktide-website-accessib/okcpiimdfkpkjcbihbmhppldhiebhhaf).\n"
}