{
  "timestamp": 1752222481982,
  "data": "---\ntags:\n  - core\n  - accessibility\n  - colour contrast\n  - wcag\n  - checklist\n  - keyboard navigation\n  - dissabilities\ntitle: Accessibility\ndescription: Improving the user experience for everyone.\nrenderAllChildPagesAsTabs: true\n---\n\n## What is accessibility?\n\nAccessibility means that websites, tools and technologies are designed and developed in a way that makes it possible for people with disabilities to use them. Accessibility also benefits people without disabilities for example people with temporary disabilities or situational disabilities.\n\nAccessibility helps people perceive, understand and interact with our digital products and it takes auditory, cognitive, neurological, physical, speech and visual limitations into consideration.\n\nBut accessibility is also a mindset and a change in the way we think and talk about digital products. It is a cultural change that cannot be made by one team only. We, therefore, urge all our colleagues as well as top management to get involved and share awareness about this very important topic. We need your support!\n\n## Why is accessibility important?\n\nOne of the main myths about accessibility is that it only concerns a small group of people with severe disabilities. This assumption is far from the reality and according to the World Health Organisation (WHO), more than 1 billion people are living with some level of impairment that affects the way they interact with digital products and access information online.\n\nWhen our websites, apps and other digital products are designed badly, they create barriers that exclude people and make access to our offerings cumbersome and in some cases not possible at all.\n\n### Being inaccessible is a problem\n\nIt is an ethical problem when we exclude certain groups of people from our products and services.\n\nIt is a legal problem, especially in the US where companies are being sued if they are not accessible, which could have financial consequences in terms of fines as well as affecting the brand negatively.\n\nIt is a big business problem - if we choose to exclude a very big group of potential customers because they have a disability.\nWhen we design and build products with accessibility in mind, we not only open up our products and experiences for more people, but our products start to become more human - in the sense that they reflect the diversity of society and become much more flexible and robust to accommodate many different needs and use cases.\n\n## The WCAG standard\n\nThe WCAG (Web Content Accessibility Guidelines) is an internationally recognized standard for accessibility that describes what needs to be taken into consideration to make a digital product or a website accessible for everyone.\nThe current version of the standard is WCAG 2.2 and it has three levels:\n\n- Level A - Basic support\n- Level AA - Ideal support\n- Level AAA - Advanced support\n\nThe accessibility information you will find on this website is focusing on helping you to become Level AA compliant. To become Level AA compliant your product has to meet all the Level A and Level AA success criteria that are listed in the <PageLink path=\"/guidelines/accessibility/guidelines/\">Accessibility Guidelines</PageLink>.\n\nTo make it as easy as possible to get started we have created a checklist that focuses on essential Level A and Level AA success criteria. <PageLink path=\"/guidelines/accessibility/checklist/\">Accessibility Checklist</PageLink>.\n\nWe have not included the Level AAA success criteria on this website. To become Level AAA compliant your product has to satisfy all the Level A, Level AA and Level AAA success criteria. To see the Level AAA success criteria, please go to the [full WCAG 2.2 standard](https://www.w3.org/TR/WCAG22/).\n\n\n<Notification>\nThe first working draft of WCAG 3.0 was published in the start of 2021, but a final W3C standard is not expected within the the next couople of years. \n\nYou can read the [WCAG 3.0 working draft](https://www.w3.org/TR/wcag-3.0/).\n</Notification>\n\n## Maersk and accessibility\n\n<Notification>\nThe Design System Team is committed to meeting or exceeding the Level AA of the WCAG 2.2 standard in all our Design System output and encourages everyone at Maersk to do the same by following first the <PageLink path=\"/guidelines/accessibility/checklist/\">Accessibility Checklist</PageLink> and then the <PageLink path=\"/guidelines/accessibility/guidelines/\">Accessibility Guidelines</PageLink>.\n\nPlease feel free to <PageLink path=\"/about/the-team/\">reach out</PageLink> if you have any questions.\n</Notification>"
}