{
  "timestamp": 1752222489459,
  "data": "---\ntags:\n  - radio\n  - select\n  - multiselect\n  - typeahead\n  - bulk\n  - actions\n  - button group\n  - checkbox\n  - default\n  - input\n  - form\n  - progressive disclosure\n  - switch\ntitle: Selection components\ndescription: Choose the most suitable selection component based on context.\n---\n\n<Notification>\nThere is a <a href=\"#summary-of-recommendations\">summary of recommendations</a> provided at the end of this guideline.\n</Notification>\n\nSelection components allow users to select one or more option from a list of values. Each selection component has advantages and disadvantages depending on the context and total options available.\n\nThere are two types of selection components:\n\n- **Selection controls**<br />Display selectable predefined values that do not require the user to type a character or a phrase to find an option.<br /><br />\n- **Selection inputs**<br />Allow for richer interaction that can help narrow the available options for selection.\n\nThis guideline provides help on choosing the most suitable selection component based on context.\n\n\n## Selection controls\n\nSelection controls are ideal when presenting six or fewer options that must be exposed and visible to the user upfront.\n\n<Notification appearance=\"warning\" heading=\"Be aware that each visible option increases cognitive load on the user.\">\nKeeping the number of options to six or fewer helps to reduce that cognitive load when using selection controls.\n</Notification>\n\n\n### Radio Group\n\nUse <PageLink path=\"/components/radio/\">Radio Groups</PageLink> to select a single item from two or more mutually exclusive options.\n\n<Example\n  imageSrc=\"./_images/radio-group.svg\"\n  caption=\"Example showing a Radio Group with a 'Maersk decides' catch-all selected option.\"\n/>\n\nUse the <a href=\"#select\">Select</a> or <a href=\"#\">Typeahead</a> components when users are required to select a single item from more than six options.\n\n<Notification appearance=\"warning\">\n**Do not use Radio Groups to turn \"on\" and \"off\" features or to control how content is presented e.g. switching between a list or card view.**\n\nIn these instances, consider using <a href=\"#switch-and-switch-group\">Switch</a> or <a href=\"#\">Segmented control</a>. \n</Notification>\n\n\n### Checkbox and Checkbox Group\n\nUse a single <PageLink path=\"/components/checkbox/\">Checkbox</PageLink> to ask users to agree or confirm specific conditions.\n\n<Example\n  imageSrc=\"./_images/checkbox.svg\"\n/>\n\nUse a <PageLink path=\"/components/checkbox/\">Checkbox Group</PageLink> when one or more logically related options are selectable.\n\n<Example\n  imageSrc=\"./_images/checkbox-group.svg\"\n/>\n\nUse the <a href=\"#switch-and-switch-group\">Switch Group</a> if users need to set features \"on\" and \"off\".\n\n\nUse the <a href=\"#multi-select\">Multi-Select</a> or <a href=\"#typeahead\">Typeahead</a> components when users are required to select a single item from more than six options.\n\n### Switch and Switch Group\n\nUse the single <PageLink path=\"/components/switch/\">Switch</PageLink> component when the selection is applied immediately, for example, choosing a dark theme.\n\n<Example\n  imageSrc=\"./_images/switch.svg\"\n/>\n\nUse the <PageLink path=\"/components/switch/\">Switch Group</PageLink> if users need to turn features \"on\" and \"off\" or applying settings etc.\n\n<Example\n  imageSrc=\"./_images/switch-group.svg\"\n/>\n\n### Segmented Control\n\nUse the <PageLink path=\"/components/segmented-control/\">Segmented Control</PageLink> to help users consume complex information in smaller chunks.\n\nThe Segmented Control is ideal for filtering content or changing the presentation of the same content to tailor for different users' mental models. \n\n<Example\n  imageSrc=\"./_images/segmented-control-1.svg\"\n/>\n\nUse the Segmented Control for changing between display views, for example, moving between card or list based views.\n\n<Example\n  imageSrc=\"./_images/segmented-control-2.svg\"\n/>\n\n<Notification appearance=\"warning\">\n**Do not use the Segmented Control for binary choices such as on/off.**<br />\nThe <a href=\"switch-and-switch-group\">Switch</a> component is more suitable.<br /><br />\n**Do not use the Segmented Control for navigating between different types of content within the same page.**<br />\nThe <PageLink path=\"/components/tabs/\">Tabs</PageLink> component is more suitable. \n</Notification>\n\n\n### Button Group\n\nUse the <PageLink path=\"/components/button-group/\">Button Group</PageLink> as an alternative to the Radio Group or Checkbox Group to allow for a more aesthetic and compact appearance that can reduce cognitive load in complex forms. \n\nThe Button Group is not a standard form component. If used in a form context, it should be used consistently as a pattern within the same form to avoid potentially confusing people. \n\n<Example\n  imageSrc=\"./_images/button-group.svg\"\n/>\n\n<Notification appearance=\"warning\" heading=\"Do not use a Button Group to switch between different content views.\">\nThe <a href=\"#segmented-control\">Segmented Control</a> is more suitable.\n</Notification>\n\n## Selection inputs\n\nSelection inputs are ideal if the user can select from seven or more options and often allow users to match options based on keyboard input. \nSelection inputs can reduce clutter on dense interfaces, which results in less cognitive load on the user.\n\n### Select\n\nUse the <PageLink path=\"/components/select/\">Select Component</PageLink> to choose one option from a predefined list of items when you have more than six options. If there are more than 10-15 options, then activate the <PageLink path=\"/components/multi-select/#search\">search functionality</PageLink>.\n\n\nAt the price of hiding all the selectable options from the immediate view, the Select component keeps the UI less cluttered, especially for complex and dense applications.\n\n<Example\n  imageSrc=\"./_images/select.svg\"\n/>\n\n### Typeahead\n\nUse the <PageLink path=\"/components/typeahead/\">Typeahead</PageLink> to choose one option from a very long list. The Typeahead is ideal for finding and selecting one option from thousands of available values, such as locations or commodity codes.\n\n<Example\n  imageSrc=\"./_images/typeahead.svg\"\n/>\n\n<Notification appearance=\"warning\" heading=\"Difference between Search in Select and Typeahead\">\nBoth components allow users to search and filter a list of options, but they differ in how users interact with the list and how results are presented.\n\nThe <PageLink path=\"/components/select\">Select</PageLink> displays the full list of options in a dropdown, allowing users to browse and select. A search field helps narrow down the list, but users can still scroll through all available options. Best for medium to long lists where the user may benefit from browsing through the list. For example, selecting a country from a list. \n\nThe <PageLink path=\"/components/typeahead\">Typeahead</PageLink> component filters and displays a limited number of results (usually 10–15) based on the user’s input. Best for very large and complex datasets where the users are unlikely to browse the full set, but instead rely on search to find a specific item. For example, searching for a port in a global database. \n</Notification>\n\n### Multi-Select\n\nUse the <PageLink path=\"/components/multi-select/\">Multi-Select</PageLink> to choose one or multiple options from a predefined list of items when you have more than six options. If there are more than 10-15 options, then activate the <PageLink path=\"/components/multi-select/#search\">search functionality</PageLink>.\n\nAt the price of hiding all the selectable options from the immediate view, the Multi-Select component keeps the UI less cluttered whilst simultaneuously providing a summary of the total number of selected options.\n\n<Example\n  imageSrc=\"./_images/multi-select.svg\"\n/>\n\n### Typeahead Multi-Select\n\nUse the <PageLink path=\"/components/typeahead-multi-select/\">Typeahead Multi-Select</PageLink> to choose multiple options from a very large list. The Typeahead Multi-Select is ideal for finding and selecting options from thousands of available values, such as locations or commodity codes.\n\n<Example\n  imageSrc=\"./_images/typeahead-multi-select-vessel-search.svg\"\n/>\n\n<Notification appearance=\"warning\" heading=\"Difference between Typeahead Multi-Select and Search in Multi-Select\">\nBoth components allow users to search and select multiple options from a list, but they serve different use cases and user behaviours.\n\nThe <PageLink path=\"/components/typeahead-multi-select\">Typeahead Multi-Select</PageLink> dynamically filters and displays a limited set of results (typically 10–15) based on the user's input. It is good for very large or complex datasets where users are unlikely to browse the full list of options and instead rely on search to find specific items. For example, selecting ports from a global database.\n\nThe <PageLink path=\"/components/multi-select\">Multi-Select</PageLink> component displays the full list of options, allowing users to browse and select multiple options. The search field helps filter the list, but users can still scroll through all available options. Is good for medium to long lists where users may want to explore the full range of options before making a selection. For example, selecting countries from a predefined list.\n</Notification>\n\n### Input Date and Input Time\n\nUse the <PageLink path=\"/components/input-date/\">Input Date</PageLink> and <PageLink path=\"/components/input-time/\">Input Time</PageLink> when users are required to select a specific date/time value from calendar.\n\n<Example\n  imageSrc=\"./_images/date.svg\"\n/>\n\n<Example\n  imageSrc=\"./_images/time.svg\"\n/>\n\n## When to use a default selection\n\nApplying default selection to selection inputs and controls can be time-saving for users. Default selection can also mislead or bias people if it is the wrong default, misread or ignored due to already being selected.\n\nFor example, if you ask people to rate your product experience, you should not preselect a value for the choice they have to make.\n\n<Grid2Cols>\n  <Example\n    imageSrc=\"./_images/default-selection-1-do.svg\"\n    indicator=\"success\"\n    caption=\"Allow people to consciously make a decision.\"\n  />\n  <Example\n    imageSrc=\"./_images/default-selection-1-dont.svg\"\n    indicator=\"error\"\n    caption=\"Don't pre-select a default option.\"\n  />\n</Grid2Cols>\n\nUse default selection when the available data is pointing with significant certainty to what the default option should be.  \n\nFor example, when requesting a phone country code and previous user input has already given you the information that suggests which code should be preselected.\n\n<Example\n  imageSrc=\"./_images/default-selection-2.svg\"\n/>\n\n<Notification appearance=\"warning\" heading=\"Avoid making a default selection read-only.\">\nFor example, selecting a location country might not mean the user has an active phone number based in the same country.  \n</Notification>\n\nIf no existing data exists (e.g. tracking, historical, or similar) to back up the default selected choice, then it is best to have no selection or a \"None\" option. Doing this avoids misleading users to submit information that was not chosen consciously. \n\nDo not provide a default selected value were unbiased data is to be collected.\n\n## Summary of recommendations\n\n### Fewer than seven options\n\nUse selection controls.\n\n<div class=\"mds-table mds-table--scrollable mds-table--small\">\n  <table>\n    <thead>\n      <tr>\n        <th width=\"60%\">Use-case</th>\n        <th width=\"60%\">Recommendation</th>\n      </tr>\n    </thead>\n    <tbody>\n      <tr>\n        <td>Select one option from a list</td>\n        <td><a href=\"#radio-group\">Radio Group</a> or <a href=\"#button-group\">Button Group</a></td>\n      </tr>\n      <tr>\n        <td>Select one or more option from a list</td>\n        <td><a href=\"#checkbox-and-checkbox-group\">Checkbox Group</a> or <a href=\"#button-group\">Button Group</a></td>\n      </tr>\n    </tbody>\n  </table>\n</div>\n\n### Seven options or more\n\nUse selection inputs.\n\n<div class=\"mds-table mds-table--scrollable mds-table--small\">\n  <table>\n    <thead>\n      <tr>\n        <th width=\"60%\">Use-case</th>\n        <th width=\"60%\">Recommendation</th>\n      </tr>\n    </thead>\n    <tbody>\n      <tr>\n        <td>Select one option from a list</td>\n        <td><a href=\"#select\">Select</a></td>\n      </tr>\n      <tr>\n        <td>Select one option from a very large list</td>\n        <td><a href=\"#typeahead\">Typeahead</a></td>\n      </tr>\n      <tr>\n        <td>Select one or more options from a list</td>\n        <td><a href=\"#multi-select\">Multi-Select</a></td>\n      </tr>\n      <tr>\n        <td>Select one or more options from a very large list</td>\n        <td><a href=\"#typeahead-multi-select\">Typeahead Multi-Select</a></td>\n      </tr>\n    </tbody>\n  </table>\n</div>\n\n### Other\n\n<div class=\"mds-table mds-table--scrollable mds-table--small\">\n  <table>\n    <thead>\n      <tr>\n        <th width=\"60%\">Use-case</th>\n        <th width=\"60%\">Recommendation</th>\n      </tr>\n    </thead>\n    <tbody>\n      <tr>\n        <td>Accepting terms and conditions</td>\n        <td><a href=\"#checkbox-and-checkbox-group\">Checkbox</a></td>\n      </tr>\n      <tr>\n        <td>Turn features on/off that take immediate effect</td>\n        <td><a href=\"#switch-and-switch-group\">Switch or Switch Group</a></td>\n      </tr>\n      <tr>\n        <td>Selecting different views or filters of the same content</td>\n        <td><a href=\"#segmented-control\">Segmented Control</a></td>\n      </tr>\n      <tr>\n        <td>Selecting date and/or time</td>\n        <td><a href=\"#input-date-and-input-time\">Input Date and Input Time</a></td>\n      </tr>\n      <tr>\n        <td>Navigating between different types of content within the same page</td>\n        <td><PageLink path=\"/components/tabs/\">Tabs</PageLink></td>\n      </tr>\n    </tbody>\n  </table>\n</div>\n"
}