{
  "timestamp": 1752222486209,
  "data": "---\ntitle: Data visualisation\nnavTitle: Data visualisation\nsecondaryNavTitle: Overview\ndescription: \"What is data visualisation, why it is important and how to apply it at Maersk.\"\ntags:\n  - data\ncontributors:\n  - thomasbove\n  - priyamohapatra\nchildPageOrder:\n  - process\n  - chart-types\n  - chart-style-guide\n  - chart-best-practice\n  - colour-best-practice\n---\n\n<AlphaWarning />\n\nData visualisation is all about presenting data in a visual format to tell a meaningful story. This guide will help you communicate the meaning of data in a simple way that is easy to understand.\n\nThe data visualisation guidelines consist of 5 parts:\n\n- <PageLink path=\"/guidelines/data-visualisation/process/\">Part 1: Data visualisation process</PageLink>\n- <PageLink path=\"/guidelines/data-visualisation/chart-types/\">Part 2: Chart types</PageLink>\n- <PageLink path=\"/guidelines/data-visualisation/chart-style-guide/\">Part 3: Chart style guide</PageLink>\n- <PageLink path=\"/guidelines/data-visualisation/chart-best-practice/\">Part 4: Chart design best practice</PageLink>\n- <PageLink path=\"/guidelines/data-visualisation/colour-best-practice/\">Part 5: Colour best practice</PageLink>\n\n<Notification heading=\"Accessibility\">\nAt the moment, the data visualisation guidelines do not meet the WCAG 2.1 - Level AA accessibility requirements.\nWe are currently looking into how we can provide a fully accessible data visualisation experience.\n\nIf you want to know more about accessibility, then <PageLink path=\"/guidelines/accessibility/\">visit our guidelines</PageLink>.\n</Notification>\n\nThese guidelines are:\n\n**For anyone**<br />\nThe guidelines are for anyone at Maersk who needs to communicate something to an internal or external audience using data.\n\n**A limited set of charts**<br />\nWe will only provide guidelines for a limited set of chart types, namely the most commonly used.\n\n**Tool agnostic**<br />\nThe guidelines are intentionally not specific to any one tool. They are applicable in any charting application or presentation software.\n\n<Notification appearance=\"warning\">\nThe examples in these guidelines use the open source JavaScript library [Chart.js](https://www.chartjs.org/). This does not mean that the design system team suggests Chart.js is a standard. Chart.js was chosen simply as a way to present and supplement the community contributed data visualisation guidelines. Please choose a charting solution that is appropriate for your product and platform.\n</Notification>\n\n## What is data visualisation?\n\nData visualisation is the graphical representation of data, where different graphical elements are used to curate data and thereby making it easier and faster to understand and digest for the audience.\n\n## Why is data visualisation important?\n\nEffective data visualisation can mean the difference between success and failure when communicating the results of data analysis.\n\nGood data visualisation can help to:\n\n**See the big picture**<br />\nUncover insights and see patterns within complex data without relying on a data scientist.\n\n**Make better decisions**<br />\nUnderstand your next steps and spend less time performing data analysis.\n\n**Present data in a meaningful way**<br />\nShare insights with others in an easy-to-understand form.\n\n**Democratise your data**<br />\nProvide one source of truth for your entire organisation.\n\n## What will not be covered by the guidelines?\n\nThese guidelines will not cover:\n\n**Infographics**<br />\nThe guidelines will not cover infographics. The field of infographics is a specialist, graphical craft focussing on \"stand-out\" visualisations rather than being part of a consistent brand.\n\n**Exploratory Visual Analysis**<br />\nThe guidelines will not cover the visualisation of distributions, trends, or uncertainty. Often referred to as Exploratory Visual Analysis. For more info on \"exploratory visual analysis\", we recommend the book \"Data Points: Visualization That Means Something\" by Nathan Yau.\n\n## The guidelines will evolve\n\nData visualisation is a big topic. The guidelines here will evolve to adapt to the needs of our users across the organisation. Other than a style guide, it does not provide design assets and some topics are not covered, i.e. how to design interactive dashboards.\n\nPlease help us by giving us feedback on what you would like to see!\n"
}