{
  "timestamp": 1752222485186,
  "data": "---\ntags:\n  - data\ntitle: Scatter/bubble chart\nnavTitle: Scatter/bubble chart\ndescription: >-\n  Use scatter and bubble charts to present patterns in large sets of data (linear or non-linear trends, correlations, clusters, or outliers).\ncontributors:\n  - thomasbove\n---\n\n<AlphaWarning />\n\nThese charts are useful to present relationships and patterns in data, but not for comparing exact values. The more data you include, the clearer the patterns become.\n\n## Scatter Chart\n\nA scatter chart is primarily used for correlation and distribution analysis. It is good for showing the relationship between two different variables where one correlates to another (or does not).\n\n<Example \n  imageSrc=\"./_images/scatter.png\"\n  darkWarning={false}\n  caption=\"A user who wants to get an overview of the relationship between 'free time granted' (the amount of time allotted for picking up a container) and the 'actual turn time' (the actual duration of the pick up).\"\n/>\n\n## Bubble Chart\n\nA bubble chart is a great option if you need to add one more dimension to a scatter plot chart. Scatter plots only display the relationship between two variables, but you can add bubble size as the third variable and thus enable comparison. Bubble charts are generally considered to be more visually appealing than scatter charts.\n\n<Example \n  imageSrc=\"./_images/bubble.png\"\n  darkWarning={false}\n  caption=\"A user who wants to explore the relationships between Maersk revenue, year growth, and number of customers per region. Each dot in the bubble chart corresponds to a single data point (i.e. country within a continent). The variables' value for each point are indicated by the horizontal position (revenue), vertical position (Maersk yearly growth) and the dot size (number of customers).\"\n/>\n\n## Best practice\n\n### Add a trend line\n\nWhen a scatter plot is used to look at a predictive or correlational relationships between variables, it can be useful to add a trend line to the plot showing a calculated best fit to the data.\n\n### Start the y-axis at zero\n\nInclude the zero line of the y-axis to represent the data accurately.\n\n### Avoid overplotting\n\nEspecially when dealing with bubble charts overplotting should be avoided so data points don't overlap to a degree where it is difficult seeing relationships between variables. This could be achieved by sampling only a subset of data points, reducing point size of the bubbles or making the bubbles semi-transparent.\n\n### Allow the user to see the exact values\n\nAdd value labels if bubbles are similar in size. If a bubble chart contains many bubbles it can be helpful to add tooltips on hover to display all the values associated with individual data points.\n"
}