{
  "timestamp": 1752222489154,
  "data": "---\ntitle: Sort patterns\nnavTitle: Sort\ndescription: >-\n  Best practices and design patterns that can help you create the sorting experience within your product.\n---\n\n## Best practices\n\n- Place sorting options in close proximity to the content that is sorted.\n- Keep sorting options limited to the most relevant to avoid overwhelming the user.\n- Sort information in logical order for the context to support the user journey.  \n  e.g. Earliest arrival, Lowest emissions, Price etc.\n- Indicate visually when and how data is sorted. e.g. A headline above list results \"Results by lowest emissions first\".\n- Allow change of the sorting direction from ascending to descending, or vice versa.\n  e.g. in tables use the arrow-up (ascending) and arrow-down (descending) icons for sorting columns.\n\n## Data table sorting\n\nWhen displaying information in a data table it is a common pattern to sort content per column to find the information faster.\n\nProvide default sorting based on the context, content and how the users want to use the table.\nDisplay clearly which column is sorted and indicate how. Table component uses arrow icons for sorting.\nKeep table cell content to one type if possible to allow for specific type of sorting\ne.g. numerical ordering, alphabetical, alpha-numerical or chronological.\nSearch and Filter patterns to help people narrow down the information even more.\n\n<Example\n  imageSrc=\"./_images/data-table.svg\"\n>\n  <div slot=\"caption\" class=\"py-3\">Data Table where the column \"Name\" is sorted alphabetically. For more info on Data Tables in general - see our <PageLink path=\"/components/table/\">Table component</PageLink>.</div>\n</Example>\n\n## List item sorting\n\nWhen displaying simple or complex lists (e.g. cards with information) a single sort control can help people to arrange the results based on different logical criteria. In these cases the sorting option allows people to surface to the \"top\" the information that they seek.\n\n- Aim to provide sorting options for long lists of information.\n- Provide a default sorting option that is defined by the context and content.\n\n<Example\n  imageSrc=\"./_images/list-item.svg\"\n  caption=\"A news section where you can sort by latest newest news and other sorting parameters.\"\n/>\n\n## Mixing Sort and Filter patterns\n\nIn some cases, it makes sense to combine filter and sorting options to provide the user with a more advanced way of finding information. It could be because it makes logical sense for the user to make these choices together or simply because you needs to optimise the screen space.\n\n<Example\n  imageSrc=\"./_images/mixing.svg\"\n  caption=\"A combination of filters and sorting in a table context.\"\n/>\n"
}