{
  "timestamp": 1752222484749,
  "data": "---\ntags:\n  - data\ntitle: Meter chart\nnavTitle: Meter chart\ndescription: >-\n  Meter charts are useful to clearly indicate the measurement of a single metric against a pre-defined target.\ncontributors:\n  - thomasbove\n---\n\n<AlphaWarning />\n\nMeters are particularly helpful when the expected value of the data is already known and the user wants to know the current performance of a particular metric. The most typical variant of Meter charts is the speedometer/gauge chart that use a needle to show information on a dial. The meter range can be color coded to show performance levels (e.g. showing green for “excellent” and red for “below expectations”).\n\nA drawback of meter charts is that they take up a lot of space and typically only show a single point of data. If there are many meter charts representing a single performance scale, other charts types might be more effective, e.g. <PageLink path=\"/guidelines/data-visualisation/chart-types/bar-chart/\">Bar charts</PageLink> and <PageLink path=\"/guidelines/data-visualisation/chart-types/bullet-chart/\">Bullet charts</PageLink>.\n\n<Example \n  imageSrc=\"./_images/meter.png\"\n  imageMaxWidth=\"400px\"\n  darkWarning={false}\n  caption=\"A user who wants to see the delivery promise fulfilment for a recent week where the target was 80% while the actual performance was only 71%.\"\n/>\n\n## Best practice\n\n### Use this chart type when there is a minimum and maximum value\n\nA speedometer/gauge chart needs to have an explicit range (minimum and maximum values) so that a metric can be accurately and consistently plotted.\n\n### Show contextual information\n\nProvide additional information about the target metric, rate of change and other important aspects of the measured performance.\n\n### Use colours for thresholds\n\nUse colours to show different thresholds or zones and clearly show where the measured value is on that scale.\n\n### Use only a few colours\n\nLimit the amount of colours to 2 - 3 for each chart and avoid high contrast color combinations between the sections. See the Chart style guide and Colour best practice pages for additional guidance on appropriate colour choices within the Maersk colour palette.\n\n### Clearly show the target\n\nVisualise a target as a distinct line on the scale so that it is easy to spot at a glance.\n"
}