{
  "timestamp": 1752222488535,
  "data": "---\ntags:\n  - core\n  - exposed\n  - hidden\n  - applied\n  - clear\ntitle: \"Search, filter and sort\"\ndescription: Help users narrow down data and find what they need.\nrenderAllChildPagesAsTabs: true\nchildPageOrder:\n  - search-patterns\n  - filter-patterns\n  - sort-patterns\n  - handling-no-results\n---\n\nOn this page, you find information on what to consider when designing and developing filtering and sorting functionality for your product.\n\nYou can use search, filter and sort functionality separately or in combination to make it easier for users to find the right information.\n\n## Search\n\nUse search concepts to find specific information within a large dataset. Search can support users when they don't know exactly what they are looking for and need to explore the dataset by entering keywords or phrases. Search concepts usually are combined with filter and/or sorting to help refine any results further.\n\nRead more about <PageLink path=\"/guidelines/search-filter-and-sort/search-patterns/\">search best practices and patterns</PageLink>.\n\n## Filter\n\nUse filter concepts to narrow down a dataset based on specific criteria. Filters help people to show only the items that meet their criteria such as a range of values, a category, or a certain date range. Filters are often used when people have a general idea of what they are looking for but want to narrow down the options to a manageable set.\n\nRead more about <PageLink path=\"/guidelines/search-filter-and-sort/filter-patterns/\">filter best practices and patterns</PageLink>.\n\n## Sort\n\nUse sort concepts to organise data based on certain criteria. Sorting allows users to quickly identify patterns or trends within the dataset. Sorting is often used when users have a large dataset and want to view the information in a more structured way such as alphabetical, numerical or chronological order.\n\nRead more about <PageLink path=\"/guidelines/search-filter-and-sort/sort-patterns/\">sort best practices and patterns</PageLink>.\n\n## How to handle no results in the search journey\n\nThe search for information could lead to no results at all and it is important to support the user in that journey by trying to prevent dead ends and providing clear guidance and feedback.\n\nRead more about <PageLink path=\"/guidelines/search-filter-and-sort/handling-no-results/\">no result cases</PageLink>.\n"
}